{
    "TrendingAPI": [
        {
            "id": 1,
            "name": "Samosa",
            "image": "https://www.cubesnjuliennes.com/wp-content/uploads/2020/08/Best-Indian-Punjabi-Samosa-Recipe.jpg",
            "ingredients": [
                "All-purpose flour (मैदा)",
                "Potatoes (आलू)",
                "Green peas (हरे मटर)",
                "Onion (प्याज)",
                "Green chili (हरी मिर्च)",
                "Ginger (अदरक)",
                "Garlic (लहसुन)",
                "Coriander leaves (धनिये के पत्ते)",
                "Spices (मसाले)",
                "Oil (तेल)"
            ],
            "Hindi_Instruction": [
                "1. एक कटोरी में 2 कप मैदा, 2 बड़े चम्मच तेल, 1/2 चम्मच नमक और जरूरत अनुसार पानी मिलाएं और एक कठोर आटा बनाएं। अच्छी तरह से मसलें और 20 मिनट के लिए ढेर दें।\n2. एक कड़ाही में 2 बड़े चम्मच तेल गरम करें और 1 चम्मच जीरा डालें।\n3. जब जीरा फटने लगे, तो उसमें 1 बारीकी से कटी हुई प्याज़ डालें और सुनहरा होने तक सौटें।\n4. 1 बड़ा चम्मच अदरक-लहसुन की पेस्ट डालें और एक मिनट तक सौटें।\n5. 2 कप उबले हुए और पिसे हुए आलू, 1/2 चम्मच हल्दी पाउडर, 1 चम्मच लाल मिर्च पाउडर, 1 चम्मच गरम मसाला और नमक स्वाद के अनुसार डालें। अच्छी तरह से मिलाएं और कुछ मिनटों के लिए पकाएँ।\n6. आटे को छोटे गोले में बाँटें और प्रत्येक गोले को पतले बैरेक में बेलें।\n7. प्रत्येक बैरेक को आधे में काटें और प्रत्येक आधे को एक शंकु में आकार दें।\n8. प्रत्येक शंकु में आलू भरें और किनारों को सील करें।\n9. एक गहरी कड़ाही में तेल गरम करें और समोसे को सुनहरा होने और कुरकुरे होने तक तलें।\n10. चटनी या अपनी पसंद की सॉस के साथ गर्मा-गर्म परोसें।"
            ],
            "English_Instructions": [
                "1. In a bowl, mix 2 cups of all-purpose flour, 2 tablespoons of oil, 1/2 teaspoon of salt, and water as needed to make a stiff dough. Knead well and let it rest for 20 minutes.\n2. Heat 2 tablespoons of oil in a pan and add 1 teaspoon of cumin seeds.\n3. Once the seeds start to splutter, add 1 finely chopped onion and sauté until it turns golden brown.\n4. Add 1 tablespoon of ginger-garlic paste and sauté for a minute.\n5. Add 2 cups of boiled and mashed potatoes, 1/2 teaspoon of turmeric powder, 1 teaspoon of red chili powder, 1 teaspoon of garam masala, and salt to taste. Mix well and cook for a few minutes.\n6. Divide the dough into small balls and roll each ball into a thin circle.\n7. Cut each circle in half and shape each half into a cone.\n8. Fill each cone with the potato filling and seal the edges.\n9. Heat oil in a deep pan and fry the samosas until golden brown and crispy.\n10. Serve hot with chutney or sauce of your choice."
            ]
        },
        {
            "id": 2,
            "name": "Vada Pav",
            "image": "https://www.cookwithmanali.com/wp-content/uploads/2018/04/Vada-Pav-500x375.jpg",
            "ingredients": [
                "Potatoes (आलू)",
                "Garlic (लहसुन)",
                "Ginger (अदरक)",
                "Green chili (हरी मिर्च)",
                "Besan (बेसन)",
                "Turmeric powder (हल्दी पाउडर)",
                "Red chili powder (लाल मिर्च पाउडर)",
                "Bun (पाव)",
                "Oil (तेल)"
            ],
            "English_Instructions": [
                "1. In a bowl, mix 1 cup of besan (gram flour), 1/4 teaspoon of turmeric powder, 1/2 teaspoon of red chili powder, 1/2 teaspoon of cumin powder, and salt to taste.\n2. Gradually add water and make a smooth batter. Set it aside for 10 minutes.\n3. Heat oil in a deep pan for frying.\n4. In a separate bowl, mix 2 boiled and mashed potatoes, 1/2 teaspoon of turmeric powder, 1/2 teaspoon of red chili powder, 1/2 teaspoon of garam masala, 1 tablespoon of finely chopped coriander leaves, and salt to taste.\n5. Shape the potato mixture into small balls.\n6. Dip each ball into the batter, making sure it's coated evenly.\n7. Fry the coated balls in hot oil until golden brown and crispy.\n8. Slice pav (buns) and spread some tamarind chutney and garlic chutney on the inner sides.\n9. Place a fried potato ball in each pav and serve hot."
            ],
            "Hindi_Instruction": [
                "1. एक कटोरी में 1 कप बेसन, 1/4 चम्मच हल्दी पाउडर, 1/2 चम्मच लाल मिर्च पाउडर, 1/2 चम्मच जीरा पाउडर और नमक स्वाद के अनुसार मिलाएँ।\n2. धीरे-धीरे पानी मिलाएं और एक मुलायम बैटर बनाएँ। 10 मिनट के लिए यह छोड़ दें।\n3. गहरी कड़ाही में तेल गर्म करें।\n4. अलग एक कटोरी में 2 उबले हुए और पिसे हुए आलू, 1/2 चम्मच हल्दी पाउडर, 1/2 चम्मच लाल मिर्च पाउडर, 1/2 चम्मच गरम मसाला, 1 बड़ा चम्मच कटी हुई हरा धनिया और नमक स्वाद के अनुसार मिलाएँ।\n5. आलू का मिश्रण को छोटे गोले में आकार दें।\n6. प्रत्येक गोले को बैटर में डुबोकर धीरे-धीरे अच्छी तरह से चढ़ाएँ।\n7. चढ़ाए गए गोले को गरम तेल में सुनहरा होने और कुरकुरे होने तक तलें।\n8. पाव (बन्स) को स्लाइस करें और उनके अंदरी तरफ इमली चटनी और लहसुन की चटनी लगाएँ।\n9. प्रत्येक पाव में एक तला हुआ आलू गोला रखें और गर्मा-गर्म परोसें।"
            ]
        },
        {
            "id": 3,
            "name": "Manchurian",
            "image": "https://irhindi.in/wp-content/uploads/2022/03/Gobi-Manchurian-recipe-irhindi.jpg",
            "ingredients": [
                "Cauliflower (फूलगोभी)",
                "All-purpose flour (मैदा)",
                "Corn flour (मकई का आटा)",
                "Ginger (अदरक)",
                "Garlic (लहसुन)",
                "Onion (प्याज)",
                "Green chili (हरी मिर्च)",
                "Capsicum (शिमला मिर्च)",
                "Spring onions (हरी प्याज)",
                "Soy sauce (सोया सॉस)",
                "Vinegar (सिरका)",
                "Oil (तेल)"
            ],
            "English_Instructions": [
                "1. In a bowl, mix 1 cup of finely chopped cabbage, 1/2 cup of grated carrots, 1/4 cup of finely chopped capsicum, 2 tablespoons of chopped spring onions, 1 tablespoon of minced garlic, 1 tablespoon of minced ginger, 2 tablespoons of all-purpose flour, 3 tablespoons of cornflour, 1 tablespoon of soy sauce, 1 tablespoon of vinegar, 1/2 teaspoon of red chili powder, and salt to taste.\n2. Mix well to form a sticky mixture.\n3. Shape the mixture into small balls or desired shapes.\n4. Heat oil in a pan for deep frying.\n5. Fry the balls until golden brown and crispy. Drain them on a paper towel to remove excess oil.\n6. In a separate pan, heat 1 tablespoon of oil.\n7. Add 1 tablespoon of minced garlic, 1 tablespoon of minced ginger, and 2 tablespoons of chopped spring onions. Sauté for a minute.\n8. Add 2 tablespoons of tomato ketchup, 1 tablespoon of soy sauce, 1 tablespoon of vinegar, and a pinch of salt. Mix well.\n9. Add the fried Manchurian balls to the sauce and toss gently until they are well coated.\n10. Garnish with chopped spring onions and serve hot."
            ],
            "Hindi_Instruction": [
                "1. एक कटोरी में 1 कप बारीकी से कटी हुई पत्तागोभी, 1/2 कप कटी हुई गाजर, 1/4 कप बारीकी से कटी हुई कैप्सिकम, 2 बड़े चम्मच कटी हुई हरी प्याज़, 1 बड़ा चम्मच कटा हुआ लहसुन, 1 बड़ा चम्मच कटा हुआ अदरक, 2 बड़े चम्मच मैदा, 3 बड़े चम्मच कॉर्नफ्लौर, 1 बड़ा चम्मच सोया सॉस, 1 बड़ा चम्मच सिरका, 1/2 चम्मच लाल मिर्च पाउडर और नमक स्वाद के अनुसार मिलाएँ।\n2. अच्छी तरह मिलाएँ ताकि एक चिपचिपा मिश्रण बने।\n3. मिश्रण को छोटे गोलों या वांछित आकार में बनाएँ।\n4. गहरी कड़ाही में तेल गर्म करें।\n5. गोलों को सुनहरा होने और कुरकुरे होने तक तलें। अधिकतम तेल निकालने के लिए उन्हें पेपर टॉवल पर निकालें।\n6. एक अलग कड़ाही में 1 बड़ा चम्मच तेल गर्म करें।\n7. उसमें 1 बड़ा चम्मच कटा हुआ लहसुन, 1 बड़ा चम्मच कटा हुआ अदरक और 2 बड़े चम्मच कटी हुई हरी प्याज़ डालें। एक मिनट के लिए सौटे।\n8. 2 बड़े चम्मच टोमेटो केचप, 1 बड़ा चम्मच सोया सॉस, 1 बड़ा चम्मच सिरका और एक चुटकी नमक डालें। अच्छी तरह मिलाएँ।\n9. तले हुए मंचूरियन गोलों को सॉस में डालें और हल्के हाथों से अच्छी तरह चिढ़काव करें।\n10. कटी हुई हरी प्याज़ से सजाएं और गरमा-गरम परोसें।"
            ]
        },
        {
            "id": 4,
            "name": "Pav Bhaji",
            "image": "https://upload.wikimedia.org/wikipedia/commons/4/4a/Bambayya_Pav_bhaji.jpg",
            "ingredients": [
                "Potatoes (आलू)",
                "Cauliflower (फूलगोभी)",
                "Carrots (गाजर)",
                "Peas (मटर)",
                "Capsicum (शिमला मिर्च)",
                "Onion (प्याज)",
                "Tomato (टमाटर)",
                "Ginger (अदरक)",
                "Garlic (लहसुन)",
                "Pav bhaji masala (पाव भाजी मसाला)",
                "Butter (मक्खन)",
                "Pav (पाव)"
            ],
            "English_Instructions": [
                "1. Heat 2 tablespoons of oil in a pan.\n2. Add 1 finely chopped onion and sauté until translucent.\n3. Add 1 tablespoon of minced garlic and 1 tablespoon of minced ginger. Sauté for a minute.\n4. Add 2 finely chopped tomatoes and cook until they turn mushy.\n5. Add 1 cup of boiled and mashed mixed vegetables (carrots, peas, cauliflower, beans, etc.).\n6. Mix well and cook for 5 minutes.\n7. Add 2 tablespoons of pav bhaji masala, 1/2 teaspoon of red chili powder, 1/2 teaspoon of turmeric powder, and salt to taste.\n8. Mix everything together and cook for another 5 minutes.\n9. Add a little water if required to adjust the consistency.\n10. In another pan, heat a little butter.\n11. Slice the pav buns and toast them on both sides until golden brown.\n12. Serve the bhaji with toasted pav, garnished with chopped onions, coriander leaves, and a lemon wedge."
            ],
            "Hindi_Instruction": [
                "1. एक कड़ाही में 2 बड़े चम्मच तेल गर्म करें।\n2. उसमें 1 कटी हुई प्याज़ डालें और उन्हें सुनहरे रंग तक सौटें।\n3. 1 बड़ा चम्मच कटा हुआ लहसुन और 1 बड़ा चम्मच कटा हुआ अदरक डालें। एक मिनट के लिए सौटें।\n4. 2 कटी हुई टमाटर डालें और उन्हें मुलायम होने तक पकाएँ।\n5. 1 कप उबले हुए और पिसे हुए मिश्रित सब्जियों (गाजर, मटर, फूलगोभी, बीन्स आदि) को डालें।\n6. अच्छी तरह मिलाएँ और 5 मिनट के लिए पकाएँ।\n7. 2 बड़े चम्मच पाव भाजी मसाला, 1/2 चम्मच लाल मिर्च पाउडर, 1/2 चम्मच हल्दी पाउडर और नमक स्वाद के अनुसार डालें।\n8. सब कुछ मिलाएँ और और 5 मिनट के लिए पकाएँ।\n9. जरूरत पड़ने पर संतुलन बदलने के लिए थोड़ा पानी डालें।\n10. दूसरे कड़ाही में थोड़ा मक्खन गर्म करें।\n11. पाव बंस को स्लाइस करें और उन्हें दोनों तरफ सुनहरे रंग तक टोस्ट करें।\n12. भाजी को टोस्टेड पाव के साथ परोसें, जिसमें कटी हुई प्याज़, धनिया पत्ती और एक नींबू का टुकड़ा हो सकता है।"
            ]
        },
        {
            "id": 5,
            "name": "Pani Puri",
            "image": "https://rumkisgoldenspoon.com/wp-content/uploads/2022/07/Pani-puri-ki-puri-recipe.jpg",
            "ingredients": [
                "Sooji (सूजी)",
                "Maida (मैदा)",
                "Boondi (बूंदी)",
                "Potatoes (आलू)",
                "Black chickpeas (काला चना)",
                "Tamarind chutney (इमली चटनी)",
                "Mint chutney (पुदीना चटनी)",
                "Spices (मसाले)",
                "Water (पानी)"
            ],
            "English_Instructions": [
                "1. Prepare the pani (spiced water) by blending 1 cup of mint leaves, 1 cup of coriander leaves, 2 green chilies, 1-inch piece of ginger, 1 tablespoon of tamarind pulp, 1 teaspoon of roasted cumin powder, 1 teaspoon of black salt, 1 teaspoon of chaat masala, and salt to taste with 2 cups of water. Strain the mixture and refrigerate.\n2. Make the stuffing by mixing 1 cup of boiled and mashed potatoes, 1/4 cup of boiled chickpeas, 1/4 cup of finely chopped onions, 1/4 cup of chopped coriander leaves, 1 teaspoon of chaat masala, 1/2 teaspoon of roasted cumin powder, 1/2 teaspoon of red chili powder, and salt to taste.\n3. Take small puris and make a small hole in each puri.\n4. Fill each puri with the stuffing.\n5. Serve the stuffed puris with chilled pani.\n6. To eat, dip each puri in the pani and enjoy the burst of flavors in your mouth!"
            ],
            "Hindi_Instruction": [
                "1. पानी (मसालेदार पानी) तैयार करें, जिसके लिए 1 कप पुदीना पत्तियाँ, 1 कप धनिया पत्तियाँ, 2 हरी मिर्चें, 1 इंच का अदरक, 1 बड़ा चम्मच इमली का गूदा, 1 छोटा चम्मच भुना हुआ जीरा पाउडर, 1 छोटा चम्मच काला नमक, 1 छोटा चम्मच चाट मसाला और नमक स्वाद के अनुसार 2 कप पानी के साथ मिक्सर में ब्लेंड करें। मिश्रण को छानकर ठंडे में रखें।\n2. स्टफिंग तैयार करें, जिसके लिए 1 कप उबले हुए और पिसे हुए आलू, 1/4 कप उबले हुए चने, 1/4 कप बारीकी से कटी हुई प्याज़, 1/4 कप कटी हुई धनिया पत्तियाँ, 1 छोटा चम्मच चाट मसाला, 1/2 छोटा चम्मच भुना हुआ जीरा पाउडर, 1/2 छोटा चम्मच लाल मिर्च पाउडर और नमक स्वाद के अनुसार मिलाएँ।\n3. छोटी पुरियों को लें और हर पुरी में एक छोटा होल बनाएँ।\n4. प्रत्येक पुरी को स्टफिंग से भरें।\n5. स्टफ़ की हुई पुरियों को ठंडे पानी के साथ परोसें।\n6. खाने के लिए, प्रत्येक पुरी को पानी में डिप करें और मुँह में रंग-बिरंगे स्वाद का आनंद लें!"
            ]
        },
        {
            "id": 6,
            "name": "Dosa",
            "image": "https://www.finedininglovers.com/sites/g/files/xknfdk626/files/2023-02/Dosa%20recipe%20via%20Deepla%20Tamang%20Unsplash.jpeg",
            "ingredients": [
                "Rice (चावल)",
                "Urad dal (उड़द दाल)",
                "Fenugreek seeds (मेथी दाना)",
                "Salt (नमक)",
                "Oil (तेल)"
            ],
            "English_Instructions": [
                "1. Soak 1 cup of rice, 1/2 cup of urad dal (split black lentils), and 1/4 cup of fenugreek seeds in water for at least 6 hours.\n2. Drain the water and grind the soaked ingredients to make a smooth batter. Add water as needed.\n3. Transfer the batter to a bowl, cover it, and let it ferment overnight or for 8-10 hours.\n4. Once fermented, add salt to taste and mix well.\n5. Heat a non-stick pan or a dosa tawa and grease it with a little oil.\n6. Pour a ladleful of batter on the center of the pan and spread it in a circular motion to make a thin dosa.\n7. Cook the dosa on medium heat until the edges turn golden brown and crispy.\n8. Flip the dosa and cook for another minute.\n9. Serve the dosa hot with coconut chutney, sambar, or any desired accompaniment."
            ],
            "Hindi_Instruction": [
                "1. 1 कप चावल, 1/2 कप उड़द दाल (स्प्लिट काली मसूर दाल) और 1/4 कप मेथी दाने को कम से कम 6 घंटे के लिए पानी में भिगो दें।\n2. पानी को छान लें और भिगोए हुए तत्वों को एक चिकना बैटर बनाने के लिए पीसें। आवश्यकतानुसार पानी डालें।\n3. बैटर को एक कटोरी में ट्रांसफर करें, ढककर रखें और इसे रात भर या 8-10 घंटे तक फ़रमेंट होने दें।\n4. एक बार फ़रमेंट होने के बाद, नमक स्वाद के अनुसार डालें और अच्छी तरह से मिलाएँ।\n5. एक नॉन-स्टिक पैन या डोसा तवा गर्म करें और इसे थोड़ा तेल से चिकना करें।\n6. पैन के केंद्र में एक लैडल भर बैटर डालें और इसे गोलाई में फैलाकर पतला डोसा बनाएँ।\n7. डोसा को मध्यम आंच पर पकाएँ जब तक कि किनारों का रंग सुनहरा और कुरकुरा नहीं हो जाता है।\n8. डोसा को फ्लिप करें और और एक मिनट और पकाएँ।\n9. गर्म डोसा को नारियल चटनी, सांभर या किसी भी पसंदीदा सहारे के साथ परोसें।"
            ]
        },
        {
            "id": 7,
            "name": "Idli",
            "image": "https://images.healthshots.com/healthshots/en/uploads/2022/09/30115812/idli-1600x900.jpg",
            "ingredients": [
                "Rice (चावल)",
                "Urad dal (उड़द दाल)",
                "Fenugreek seeds (मेथी दाना)",
                "Salt (नमक)"
            ],
            "English_Instructions": [
                "1. Wash 1 cup of parboiled rice and 1 cup of urad dal (split black lentils) separately.\n2. Soak them in water for 4-6 hours.\n3. Grind the soaked urad dal and rice separately to a smooth batter using some water.\n4. Mix both batters together in a large bowl and add salt to taste.\n5. Allow the batter to ferment overnight or for 8-10 hours.\n6. Grease the idli molds with oil or ghee.\n7. Pour the batter into the molds, filling them halfway.\n8. Steam the idlis in a steamer for about 10-12 minutes or until they are cooked.\n9. Use a knife or skewer to check if the idlis are done; it should come out clean.\n10. Remove the idlis from the molds and serve them hot with coconut chutney and sambar."
            ],
            "Hindi_Instruction": [
                "1. 1 कप परबॉयल्ड चावल और 1 कप उड़द दाल (स्प्लिट काली मसूर दाल) को अलग-अलग धोएँ।\n2. इन्हें 4-6 घंटे के लिए पानी में भिगो दें।\n3. भिगी हुई उड़द दाल और चावल को अलग-अलग पानी के साथ चिकना बैटर बनाने के लिए पीसें।\n4. एक बड़ी कटोरी में दोनों बैटर को मिलाएँ और नमक स्वाद के अनुसार मिलाएँ।\n5. बैटर को रात भर या 8-10 घंटे तक फ़रमेंट होने दें।\n6. इडली के मोल्ड्स को तेल या घी से चिकना करें।\n7. मोल्ड्स में बैटर डालें, उन्हें आधा भरें।\n8. इडली को स्टीमर में 10-12 मिनट तक पकाएँ या जब तक कि वे पक जाएँ।\n9. इडली पक जाने पर उन्हें निकालें और नारियल चटनी और सांभर के साथ गर्म होते हुए परोसें।"
            ]
        },
        {
            "id": 8,
            "name": "Biryani",
            "image": "https://recipesofhome.com/wp-content/uploads/2020/06/veg-biryani-recipe.jpg",
            "ingredients": [
                "Basmati rice (बासमती चावल)",
                "Vegetables (सब्जियां)",
                "Onion (प्याज)",
                "Tomato (टमाटर)",
                "Ginger-garlic paste (अदरक-लहसुन की पेस्ट)",
                "Biryani masala (बिरयानी मसाला)",
                "Saffron strands (केसर के धागे)",
                "Mint leaves (पुदीने के पत्ते)",
                "Ghee (घी)",
                "Yogurt (दही)",
                "Spices (मसाले)",
                "Water (पानी)"
            ],
            "English_Instructions": [
                "1. Rinse and soak 2 cups of basmati rice in water for 30 minutes. Drain and set aside.\n2. Heat ghee or oil in a large pan and add whole spices like cinnamon, cardamom, cloves, and bay leaves.\n3. Add finely chopped onions and sauté until golden brown.\n4. Add ginger-garlic paste, green chilies, and cook for a minute.\n5. Add chopped tomatoes and cook until they turn mushy.\n6. Add spices like turmeric powder, red chili powder, biryani masala, and salt. Mix well.\n7. Add yogurt, mint leaves, and coriander leaves. Cook for a few minutes.\n8. Add the soaked rice and mix gently.\n9. Pour water, cover the pan, and cook on low heat until the rice is cooked and the flavors are infused.\n10. In a separate pan, heat ghee and fry cashews and raisins until golden.\n11. Garnish the cooked biryani with fried cashews, raisins, and chopped coriander leaves.\n12. Serve hot with raita or salan (curry)."
            ],
            "Hindi_Instruction": [
                "1. 2 कप बासमती चावल को पानी में 30 मिनट के लिए धोकर भिगो दें। छानकर अलग रखें।\n2. एक बड़े पैन में घी या तेल गर्म करें और दालचीनी, इलायची, लौंग, और तेज पत्ता जैसे पूरे मसाले डालें।\n3. बारीकी से कटा हुआ प्याज डालें और सुनहरे भूरे होने तक सौटे।\n4. अदरक-लहसुन का पेस्ट, हरी मिर्च डालें और एक मिनट तक पकाएँ।\n5. कटा हुआ टमाटर डालें और उन्हें मुलायम होने तक पकाएँ।\n6. हल्दी पाउडर, लाल मिर्च पाउडर, बिरयानी मसाला और नमक जैसे मसाले डालें। अच्छी तरह मिलाएँ।\n7. दही, पुदीना पत्ती और धनिया पत्ती डालें। कुछ मिनट तक पकाएँ।\n8. भिगोए हुए चावल डालें और सहजता से मिलाएँ।\n9. पानी डालें, पैन को ढककर मध्यम आंच पर पकाएँ जब तक चावल पक जाएँ और स्वाद घुल जाएँ।\n10. एक अलग पैन में घी गर्म करें और काजू और किशमिश को सुनहरा होने तक तलें।\n11. पकी हुई बिरयानी को तले हुए काजू, किशमिश और कटा हुआ धनिया पत्ती से सजाएँ।\n12. गर्म गर्म रायता या सालन के साथ परोसें।"
            ]
        },
        {
            "id": 9,
            "name": "Chole Bhature",
            "image": "https://i0.wp.com/swadisht.life/en/wp-content/uploads/2023/02/Chole-Bhature-Recipe.jpg",
            "ingredients": [
                "Chickpeas (छोले)",
                "Onion (प्याज)",
                "Tomato (टमाटर)",
                "Ginger (अदरक)",
                "Garlic (लहसुन)",
                "Green chili (हरी मिर्च)",
                "Spices (मसाले)",
                "All-purpose flour (मैदा)",
                "Semolina (सूजी)",
                "Yogurt (दही)",
                "Oil (तेल)"
            ],
            "English_Instructions": [
                "1. Rinse and soak 1 cup of chickpeas (chole) overnight. Drain and set aside.\n2. Pressure cook the soaked chickpeas with water, salt, and tea bags until they are soft and cooked.\n3. Heat oil in a pan and add cumin seeds, cloves, cinnamon stick, and bay leaves. Sauté until fragrant.\n4. Add finely chopped onions and cook until they turn golden brown.\n5. Add ginger-garlic paste, green chilies, and sauté for a minute.\n6. Add chopped tomatoes and cook until they become soft.\n7. Add spices like turmeric powder, coriander powder, cumin powder, red chili powder, and garam masala. Mix well.\n8. Add the cooked chickpeas and mix with the masala. Cook for a few minutes.\n9. Garnish with fresh coriander leaves and a squeeze of lemon juice.\n10. For bhature, mix all-purpose flour, semolina, yogurt, salt, and water to make a soft dough. Let it rest for 1-2 hours.\n11. Divide the dough into small balls and roll them into circles.\n12. Deep fry the bhature in hot oil until they puff up and turn golden brown.\n13. Serve hot chole with bhature and garnish with chopped onions and pickles."
            ],
            "Hindi_Instruction": [
                "1. 1 कप छोले को रात भर भिगोकर धो लें। छानकर अलग रखें।\n2. भिगोए हुए छोले को पानी, नमक और चाय के बैग के साथ प्रेशर कुकर में पकाएँ जब तक कि वे नरम और पक जाएँ।\n3. पैन में तेल गर्म करें और जीरा, लौंग, दालचीनी के टुकड़े और तेज पत्ता डालें। खुशबू आने तक सौटें।\n4. बारीकी से कटा हुआ प्याज डालें और सुनहरा होने तक पकाएँ।\n5. अदरक-लहसुन का पेस्ट, हरी मिर्च डालें और एक मिनट तक सौटें।\n6. कटा हुआ टमाटर डालें और नरम होने तक पकाएँ।\n7. हल्दी पाउडर, धनिया पाउडर, जीरा पाउडर, लाल मिर्च पाउडर और गरम मसाला जैसे मसाले डालें। अच्छी तरह मिलाएँ।\n8. पकाए हुए छोले को मसाले के साथ मिलाएँ। कुछ मिनट तक पकाएँ।\n9. ताजा कोरियांदर के पत्ते और नींबू रस से सजाएँ।\n10. भटूरे के लिए, मैदा, सूजी, दही, नमक और पानी मिलाकर एक नरम आटा बनाएँ। 1-2 घंटे के लिए आराम दें।\n11. आटे को छोटे-छोटे गोल बनाएं और उन्हें चपाती की तरह बेलें।\n12. गरम तेल में भटूरे को तलें जब तक कि वे फूलें और सुनहरे हो जाएँ।\n13. गर्म छोले के साथ भटूरे परोसें और कटे हुए प्याज़ और अचार के साथ सजाएँ।"
            ]
        },
        {
            "id": 10,
            "name": "Kachori",
            "image": "https://www.funfoodfrolic.com/wp-content/uploads/2022/03/Kachori-Blog.jpg",
            "ingredients": [
                "All-purpose flour (मैदा)",
                "Moong dal (मूंग दाल)",
                "Ginger-green chili paste (अदरक-हरी मिर्च की पेस्ट)",
                "Fennel seeds (सौंफ)",
                "Red chili powder (लाल मिर्च पाउडर)",
                "Garam masala (गरम मसाला)",
                "Cumin seeds (जीरा)",
                "Oil (तेल)"
            ],
            "English_Instructions": [
                "1. In a bowl, mix 2 cups of all-purpose flour, 1/4 cup of melted ghee or oil, and a pinch of salt.\n2. Add water gradually and knead into a firm dough. Cover and let it rest for 15-20 minutes.\n3. In a separate bowl, prepare the stuffing by mixing 1 cup of soaked and drained moong dal, 1 tablespoon of ginger-green chili paste, 1 teaspoon of fennel seeds, 1 teaspoon of red chili powder, 1/2 teaspoon of garam masala, and salt to taste.\n4. Heat oil in a pan and add 1 teaspoon of cumin seeds. Once they splutter, add the dal mixture and cook until it becomes dry.\n5. Take a small portion of the dough, flatten it, and place a spoonful of the stuffing in the center.\n6. Seal the edges of the dough to form a ball and gently flatten it.\n7. Repeat the process for the remaining dough and stuffing.\n8. Heat oil in a deep pan for frying.\n9. Carefully slide the kachoris into the hot oil and fry until they turn golden brown and crispy.\n10. Drain the excess oil on a paper towel.\n11. Serve hot with tamarind chutney or green chutney."
            ],
            "Hindi_Instruction": [
                "1. एक कटोरी में 2 कप मैदा, 1/4 कप गर्म घी या तेल और एक चुटकी नमक मिलाएं।\n2. धीरे-धीरे पानी मिलाते हुए एक कठोर आटा बनाएं। इसे ढककर 15-20 मिनट के लिए आराम दें।\n3. एक अलग कटोरी में 1 कप भिगोई हुई और चाणकर निकाली हुई मूंग दाल, 1 बड़ा चम्मच अदरक-हरी मिर्च की पेस्ट, 1 चम्मच सौंफ, 1 चम्मच लाल मिर्च पाउडर, 1/2 चम्मच गरम मसाला और नमक स्वाद के अनुसार मिलाएं।\n4. एक कड़ाही में तेल गरम करें और 1 चम्मच जीरा डालें। जब वे फटने लगें, तो दाल का मिश्रण डालें और जब तक वह सूख जाएँ तब तक पकाएं।\n5. आटे का एक छोटा हिस्सा लें, उसे पतला बनाएं और उसके बीच में भरवां कोशिश करें।\n6. आटे के किनारों को सील करें और हल्के हाथों से सपाट करें।\n7. शेष आटे और भरवां के लिए यह प्रक्रिया दोहराएँ।\n8. गहरी कड़ाही में तेल गरम करें।\n9. सतही कचोरियाँ ध्यान से गरम तेल में घुसाएँ और सुनहरे भूरे रंग और कुरकुरे होने तक पकाएँ।\n10. अधिक तेल को पेपर टॉवल पर छानें।\n11. टेमरिंड चटनी या हरी चटनी के साथ गर्मा-गर्म सर्व करें।"
            ]
        },
        {
            "id": 11,
            "name": "Burger",
            "image": "https://www.foodandwine.com/thmb/pwFie7NRkq4SXMDJU6QKnUKlaoI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/Ultimate-Veggie-Burgers-FT-Recipe-0821-5d7532c53a924a7298d2175cf1d4219f.jpg",
            "ingredients": [
                "Potatoes (आलू)",
                "Carrots (गाजर)",
                "Onion (प्याज)",
                "Bell peppers (शिमला मिर्च)",
                "Coriander leaves (धनिया पत्ती)",
                "Ginger-garlic paste (अदरक-लहसुन की पेस्ट)",
                "Red chili powder (लाल मिर्च पाउडर)",
                "Garam masala (गरम मसाला)",
                "Cumin powder (जीरा पाउडर)",
                "Bread crumbs (ब्रेड क्रम्ब्स)",
                "Tomato ketchup (टमाटर केचप)",
                "Chili sauce (चिली सॉस)",
                "Mayonnaise (मेयोनेज़)",
                "Burger buns (बर्गर बन्स)",
                "Lettuce (सलाद पत्ता)",
                "Tomato (टमाटर)",
                "Cucumber (खीरा)",
                "Oil (तेल)"
            ],
            "English_Instructions":[
                "1. In a mixing bowl, combine 2 cups of boiled and mashed potatoes, 1/2 cup of grated carrots, 1/4 cup of finely chopped onions, 1/4 cup of finely chopped bell peppers, 2 tablespoons of finely chopped coriander leaves, 1 teaspoon of ginger-garlic paste, 1 teaspoon of red chili powder, 1/2 teaspoon of garam masala, 1/2 teaspoon of cumin powder, salt to taste, and 2 tablespoons of bread crumbs.\n2. Mix all the ingredients well until they are evenly combined.\n3. Divide the mixture into equal-sized portions and shape them into patties.\n4. Heat 2 tablespoons of oil in a pan and cook the patties on medium heat until they turn golden brown on both sides.\n5. In a separate pan, heat 1 tablespoon of oil and sauté 1 finely chopped onion and 1 finely chopped capsicum until they are slightly soft.\n6. Add 2 tablespoons of tomato ketchup, 1 tablespoon of chili sauce, 1 tablespoon of mayonnaise, and salt to taste. Mix well.\n7. Slice the burger buns horizontally and toast them lightly on a pan or toaster.\n8. Place a lettuce leaf on the bottom half of each bun.\n9. Add a cooked patty on top of the lettuce.\n10. Spread the prepared sauce mixture on the patty.\n11. Top it with sliced tomatoes, onions, and cucumber.\n12. Cover with the other half of the bun.\n13. Serve hot with fries or a side salad."
            ],
            "Hindi_Instruction":[
                "1. एक मिक्सिंग बाउल में, 2 कप उबले हुए और मैश किए गए आलू, 1/2 कप कद्दूकस की हुई गाजर, 1/4 कप बारीकी से कटी हुई प्याज़, 1/4 कप बारीकी से कटी हुई शिमला मिर्च, 2 बड़े चम्मच कटा हुआ धनिया पत्ती, 1 चम्मच अदरक-लहसुन की पेस्ट, 1 चम्मच लाल मिर्च पाउडर, 1/2 चम्मच गरम मसाला, 1/2 चम्मच जीरा पाउडर, स्वादानुसार नमक, और 2 बड़े चम्मच ब्रेड क्रम्ब्स को मिलाएं।\n2. सभी सामग्री को अच्छी तरह से मिलाएं ताकि वे अच्छी तरह से मिश्रित हो जाएं।\n3. मिश्रण को बराबर भागों में बांटें और पैटी बनाएं।\n4. एक कड़ाही में 2 बड़े चम्मच तेल गरम करें और मध्यम आंच पर पैटी को सुनहरे भूरे होने तक पकाएं।\n5. एक अलग कड़ाही में 1 बड़ा चम्मच तेल गरम करें और 1 बारीकी से कटी हुई प्याज़ और 1 बारीकी से कटी हुई शिमला मिर्च को थोड़ा सा नरम होने तक सौटें।\n6. 2 बड़े चम्मच टोमैटो केचप, 1 बड़ा चम्मच चिली सॉस, 1 बड़ा चम्मच मेयोनेज़, और स्वादानुसार नमक डालें। अच्छी तरह मिलाएं।\n7. बर्गर बन्स को आधारभूत रूप से साइस करें।\n8. पत्तियों की एक पत्ती को हरा-भरा नीचे की ओर रखें।\n9. ऊपर में एक पकी हुई पैटी रखें।\n10. तैयार की हुई सॉस मिश्रण को पैटी पर फैलाएं।\n11. टमाटर, प्याज़, और ककड़ी से टॉप करें।\n12. दूसरी पत्ती से ढकें।\n13. फ्राइज़ या साइड सलाद के साथ गर्मा-गर्म सर्व करें।"
            ]

        }
    ],
    "PunjabiFoodAPI": [
        {
            "id": 1,
            "name": "Chole Bhature",
            "image": "https://i0.wp.com/swadisht.life/en/wp-content/uploads/2023/02/Chole-Bhature-Recipe.jpg",
            "ingredients": [
                "Chickpeas (chole) [छोले]",
                "Onion [प्याज]",
                "Tomato [टमाटर]",
                "Ginger [अदरक]",
                "Garlic [लहसुन]",
                "Green chili [हरी मिर्च]",
                "Turmeric powder [हल्दी पाउडर]",
                "Red chili powder [लाल मिर्च पाउडर]",
                "Coriander powder [धनिया पाउडर]",
                "Cumin powder [जीरा पाउडर]",
                "Amchur powder (dry mango powder) [अमचूर पाउडर (सूखे आम का पाउडर)]",
                "Garam masala [गरम मसाला]",
                "Oil [तेल]",
                "Salt [नमक]",
                "Baking soda [बेकिंग सोडा]",
                "Yogurt [दही]",
                "All-purpose flour (maida) [मैदा]",
                "Semolina (sooji/rava) [सूजी/रवा]",
                "Salt [नमक]",
                "Oil [तेल]"
            ],
            "English_Instructions": [
                "1. Rinse and soak 1 cup of chickpeas overnight.\n2. Pressure cook the soaked chickpeas with 4 cups of water, 2 tea bags, 1 cinnamon stick, 3-4 cloves, 2-3 green cardamoms, and salt.\n3. Heat oil in a pan, add cumin seeds, and let them splutter.\n4. Add finely chopped onions and sauté until golden brown.\n5. Add ginger-garlic paste and sauté for a minute.\n6. Add chopped tomatoes and cook until they turn soft.\n7. Add spices like turmeric, red chili powder, coriander powder, cumin powder, and garam masala. Cook for a minute.\n8. Add the cooked chickpeas along with the water and mix well.\n9. Simmer for 10-15 minutes until the flavors blend.\n10. For the bhature, mix 2 cups of all-purpose flour, 1/2 cup of semolina, 1/2 teaspoon of baking powder, salt, and yogurt to make a soft dough. Let it rest for 2 hours.\n11. Divide the dough into small balls and roll them into round shapes.\n12. Deep fry the bhature in hot oil until they puff up and turn golden brown.\n13. Serve the chole with hot bhature, garnished with chopped onions, green chilies, and lemon wedges."
            ],
            "Hindi_Instruction": [
                "1. छोले को धोकर रात भर के लिए भिगो दें।\n2. भिगोए हुए छोले को 4 कप पानी, 2 टी बैग, 1 दालचीनी की छड़, 3-4 लौंग, 2-3 हरी इलायची और नमक के साथ प्रेशर कुकर में पकाएं।\n3. एक कड़ाही में तेल गरम करें, जीरा डालें और उन्हें फटने दें।\n4. बारीक कटी हुई प्याज़ डालें और सुनहरा होने तक सौटे करें।\n5. अदरक-लहसुन की पेस्ट डालें और एक मिनट तक सौटें।\n6. कटे हुए टमाटर डालें और नरम होने तक पकाएं।\n7. हल्दी, लाल मिर्च पाउडर, धनिया पाउडर, जीरा पाउडर और गरम मसाला जैसे मसाले डालें। एक मिनट तक पकाएं।\n8. पके हुए छोले को पानी के साथ मिलाएं और अच्छी तरह से मिक्स करें।\n9. स्वादों को मिलाने के लिए 10-15 मिनट तक धीमी आंच पर पकाएं।\n10. भटूरे के लिए, 2 कप मैदा, 1/2 कप सूजी, 1/2 चम्मच बेकिंग पाउडर, नमक और दही मिलाकर एक नरम आटा बनाएं। इसे 2 घंटे के लिए आराम दें।\n11. आटे को छोटे गोल बनाकर वृत्ताकार रोल करें।\n12. गरम तेल में भटूरे को तलें, जब वे फूल जाएं और सुनहरे हो जाएं।\n13. छोले को गरम भटूरे के साथ परोसें, ऊपर से कटी हुई प्याज़, हरी मिर्च और नींबू के टुकड़ों से सजाएं।"
            ]
        },
        {
            "id": 2,
            "name": "Rajma Chawal",
            "image": "https://www.secondrecipe.com/wp-content/uploads/2017/08/rajma-chawal-1.jpg",
            "ingredients": [
                "Kidney beans (rajma) [राजमा]",
                "Onion [प्याज]",
                "Tomato [टमाटर]",
                "Ginger [अदरक]",
                "Garlic [लहसुन]",
                "Green chili [हरी मिर्च]",
                "Turmeric powder [हल्दी पाउडर]",
                "Red chili powder [लाल मिर्च पाउडर]",
                "Coriander powder [धनिया पाउडर]",
                "Cumin powder [जीरा पाउडर]",
                "Garam masala [गरम मसाला]",
                "Oil [तेल]",
                "Salt [नमक]",
                "Basmati rice [बासमती चावल]",
                "Water [पानी]",
                "Ghee [घी]",
                "Cumin seeds [जीरा]"
            ],
            "English_Instructions": [
                "1. Rinse 1 cup of rajma (kidney beans) and soak them in water for 8 hours or overnight.\n2. Drain the soaked rajma and add them to a pressure cooker with 4 cups of water, 2 bay leaves, 1 cinnamon stick, 3-4 cloves, 2-3 green cardamoms, and salt to taste.\n3. Pressure cook the rajma for about 15-20 minutes until they are soft and cooked.\n4. Heat oil in a pan and add cumin seeds.\n5. Once the cumin seeds splutter, add finely chopped onions and sauté until golden brown.\n6. Add ginger-garlic paste and sauté for a minute.\n7. Add chopped tomatoes and cook until they turn mushy.\n8. Add spices like turmeric, red chili powder, coriander powder, cumin powder, and garam masala. Cook for a minute.\n9. Add the cooked rajma to the pan along with the water. Mix well and simmer for 10-15 minutes.\n10. For the rice, wash and rinse 1 cup of basmati rice. In a separate pot, boil 4 cups of water and add the rice. Cook until the rice is tender and fluffy.\n11. Serve hot rajma curry with steamed basmati rice, garnished with fresh cilantro leaves."
            ],
            "Hindi_Instruction": [
                "1. 1 कप राजमा को धोकर 8 घंटे या रात भर के लिए पानी में भिगो दें।\n2. भिगोए हुए राजमा को छानकर 4 कप पानी, 2 बय पत्ती, 1 दालचीनी की छड़, 3-4 लौंग, 2-3 हरी इलायची और नमक स्वाद के साथ प्रेशर कुकर में डालें।\n3. राजमा को 15-20 मिनट के लिए प्रेशर कुकर में पकाएं, जब वे मुलायम और पके हो जाएं।\n4. एक कड़ाही में तेल गरम करें और जीरा डालें।\n5. जब जीरा फटने लगें, बारीक कटे हुए प्याज़ डालें और सुनहरा होने तक सौटें।\n6. अदरक-लहसुन की पेस्ट डालें और एक मिनट तक सौटें।\n7. कटे हुए टमाटर डालें और मुलायम होने तक पकाएं।\n8. हल्दी, लाल मिर्च पाउडर, धनिया पाउडर, जीरा पाउडर और गरम मसाला जैसे मसाले डालें। एक मिनट तक पकाएं।\n9. पके हुए राजमा को कड़ाही में डालें और पानी के साथ मिलाएं। अच्छी तरह से मिक्स करें और 10-15 मिनट के लिए हल्की आंच पर पकाएं।\n10. चावल के लिए, 1 कप बासमती चावल को धोएं और धूप में सुखा दें। अलग एक बर्तन में 4 कप पानी उबालें और चावल डालें। चावल तक और फूला हुआ होने तक पकाएं।\n11. गरम राजमा सब्जी को स्टीम किए हुए बासमती चावल के साथ परोसें, ऊपर से ताजा हरा धनिया पत्तियों से सजाएं।"
            ]
        },
        {
            "id": 3,
            "name": "Sarson da Saag and Makki di Roti",
            "image": "https://im.whatshot.in/img/2019/Dec/khalsa-cropped-3-1577706331.jpg",
            "ingredients": [
                "Mustard greens (sarson saag) [सरसों के पत्ते (सरसों साग)]",
                "Spinach [पालक]",
                "Bathua leaves [बथुआ पत्ते]",
                "Green chili [हरी मिर्च]",
                "Ginger [अदरक]",
                "Garlic [लहसुन]",
                "Cornmeal (makki ka atta) [मक्के का आटा]",
                "Whole wheat flour [गेहूं का आटा]",
                "Ghee [घी]",
                "Salt [नमक]",
                "Water [पानी]"
            ],
            "English_Instructions": [
                "1. Clean and wash 500 grams of mustard greens (sarson) thoroughly.\n2. Boil the mustard greens in a pot with water, 1 teaspoon of salt, and 1/2 teaspoon of turmeric powder until tender.\n3. Drain the cooked greens and let them cool down. Then, blend them into a coarse paste using a blender or food processor.\n4. Heat ghee or oil in a pan and add cumin seeds, chopped onions, and green chilies. Sauté until the onions turn golden brown.\n5. Add ginger-garlic paste and sauté for a minute.\n6. Add tomato puree and cook until the oil separates.\n7. Add spices like red chili powder, coriander powder, and garam masala. Cook for a minute.\n8. Add the blended mustard greens to the pan and mix well. Simmer for 10-15 minutes.\n9. For the Makki di Roti, mix 2 cups of maize flour (makki ka atta), salt, and water to make a soft dough. Divide it into small balls and roll them into flat discs.\n10. Cook the rotis on a hot griddle until they are golden brown on both sides.\n11. Serve hot Sarson da Saag with Makki di Roti, topped with a dollop of butter or ghee."
            ],
            "Hindi_Instruction": [
                "1. 500 ग्राम सरसों को अच्छी तरह से साफ करें और धो लें।\n2. सरसों को एक बर्तन में पानी, 1 चम्मच नमक और 1/2 चम्मच हल्दी पाउडर के साथ उबालें, जब तक वे नरम न हो जाएं।\n3. पके हुए सरसों को छान लें और उन्हें ठंडा होने दें। फिर, उन्हें ब्लेंडर या फूड प्रोसेसर का उपयोग करके एक ठोस पेस्ट बनाएं।\n4. एक कड़ाही में घी या तेल गरम करें और उसमें जीरा, कटे हुए प्याज़ और हरी मिर्च डालें। प्याज़ सुनहरा होने तक सौटें।\n5. अदरक-लहसुन की पेस्ट डालें और एक मिनट तक सौटें।\n6. टमाटर का प्यूरी डालें और तब तक पकाएं जब तक तेल अलग न हो जाए।\n7. लाल मिर्च पाउडर, धनिया पाउडर और गरम मसाला जैसे मसाले डालें। एक मिनट तक पकाएं।\n8. ब्लेंड किए हुए सरसों को कड़ाही में डालें और अच्छी तरह से मिलाएं। 10-15 मिनट के लिए हल्की आंच पर पकाएं।\n9. मक्की दी रोटी के लिए, 2 कप मक्के के आटे, नमक और पानी मिलाकर एक मुलायम आटा बनाएं। इसे छोटे गोल बनाएं और पतली रोटी बेलें।\n10. गर्म तवे पर रोटी को सेकें, जब तक वे दोनों तरफ से सुनहरे न हो जाएं।\n11. गरम सरसों दा साग को मक्की दी रोटी के साथ परोसें, ऊपर से मक्खन या घी की मोटी मुर्गई डालें।"
            ]
        },
        {
            "id": 4,
            "name": "Paneer Tikka",
            "image": "https://s3.amazonaws.com/static.realcaliforniamilk.com/media/recipes_2/paneer-tikka-masala.jpg",
            "ingredients": [
                "Paneer (Indian cottage cheese) [पनीर]",
                "Yogurt [दही]",
                "Ginger-garlic paste [अदरक-लहसुन पेस्ट]",
                "Lemon juice [नींबू का रस]",
                "Turmeric powder [हल्दी पाउडर]",
                "Red chili powder [लाल मिर्च पाउडर]",
                "Coriander powder [धनिया पाउडर]",
                "Cumin powder [जीरा पाउडर]",
                "Garam masala [गरम मसाला]",
                "Kasuri methi (dried fenugreek leaves) [कसूरी मेथी (सूखी मेथी के पत्ते)]",
                "Oil [तेल]",
                "Onion [प्याज]",
                "Capsicum [शिमला मिर्च]",
                "Tomato [टमाटर]",
                "Salt [नमक]",
                "Skewers [स्क्यूअर्स]"
            ],
            "English_Instructions": [
                "1. Cut 250 grams of paneer (cottage cheese) into cubes and set aside.\n2. In a bowl, mix 2 tablespoons of thick yogurt, 1 tablespoon of besan (gram flour), 1 teaspoon of ginger-garlic paste, 1 teaspoon of chaat masala, 1/2 teaspoon of turmeric powder, 1/2 teaspoon of red chili powder, 1/2 teaspoon of garam masala, and salt to taste.\n3. Add the paneer cubes to the marinade and gently toss them until well-coated. Let it marinate for 30 minutes.\n4. Preheat the grill or oven to medium-high heat.\n5. Thread the marinated paneer cubes onto skewers or place them on a greased grill tray.\n6. Grill the paneer cubes for 10-12 minutes, turning them occasionally, until they are golden brown and slightly charred.\n7. Remove the paneer tikka from the skewers or tray.\n8. Serve hot with mint chutney, onion rings, and lemon wedges."
            ],
            "Hindi_Instruction": [
                "1. 250 ग्राम पनीर को क्यूब्स में काटें और अलग रखें।\n2. एक कटोरी में 2 बड़े चम्मच दही, 1 बड़ा चम्मच बेसन, 1 चम्मच अदरक-लहसुन की पेस्ट, 1 चम्मच चाट मसाला, 1/2 चम्मच हल्दी पाउडर, 1/2 चम्मच लाल मिर्च पाउडर, 1/2 चम्मच गरम मसाला और नमक स्वाद के साथ मिलाएं।\n3. पनीर क्यूब्स को मैरिनेड मिश्रण में डालें और हल्के हाथों से अच्छी तरह से मिलाएं। 30 मिनट के लिए मैरिनेट करें।\n4. ग्रिल या ओवन को मध्यम-उच्च तापमान पर पूर्व-गर्म करें।\n5. मैरिनेटेड पनीर क्यूब्स को स्क्यूअर पर थ्रेड करें या उन्हें एक ग्रीस्ड ग्रिल ट्रे पर रखें।\n6. पनीर क्यूब्स को 10-12 मिनट तक ग्रिल करें, बार-बार पलटते रहें, जब तक वे सुनहरे भूरे न हो जाएं।\n7. स्क्यूअर या ट्रे से पनीर टिक्का निकालें।\n8. मिंट चटनी, प्याज़ के छलके और नींबू के वेज़ द्वारा गर्म सर्व करें।"
            ]
        },
        {
            "id": 5,
            "name": "Aloo Paratha",
            "image": "https://www.vegrecipesofindia.com/wp-content/uploads/2009/08/aloo-paratha-recipe-2.jpg",
            "ingredients": [
                "Whole wheat flour [गेहूं का आटा]",
                "Potato [आलू]",
                "Onion [प्याज]",
                "Green chili [हरी मिर्च]",
                "Ginger [अदरक]",
                "Coriander leaves [धनिया पत्ती]",
                "Cumin powder [जीरा पाउडर]",
                "Red chili powder [लाल मिर्च पाउडर]",
                "Garam masala [गरम मसाला]",
                "Oil [तेल]",
                "Salt [नमक]",
                "Water [पानी]"
            ],
            "English_Instructions": [
                "1. Boil 3 medium-sized potatoes until they are fully cooked. Peel and mash them in a bowl.\n2. In a separate bowl, take 2 cups of whole wheat flour, 1/2 teaspoon of salt, and 1 tablespoon of oil. Mix well.\n3. Add water gradually and knead into a smooth dough. Cover it and let it rest for 15-20 minutes.\n4. Divide the dough into equal-sized balls and the mashed potatoes into smaller balls.\n5. Take a dough ball, roll it into a small disc, and place the potato ball in the center.\n6. Seal the edges of the dough and flatten it gently with your palms.\n7. Roll the stuffed ball into a paratha, dusting with flour if needed.\n8. Heat a tawa or griddle over medium heat and place the rolled paratha on it.\n9. Cook the paratha on both sides, applying oil or ghee, until it turns golden brown and crispy.\n10. Serve hot with yogurt, pickle, or any chutney of your choice."
            ],
            "Hindi_Instruction": [
                "1. 3 मध्यम आकार के आलू को पूरी तरह से पका लें। उन्हें छिलकर एक कटोरी में मैश करें।\n2. एक अलग कटोरी में 2 कप गेहूं का आटा, 1/2 चम्मच नमक और 1 बड़ा चम्मच तेल लें। अच्छी तरह मिलाएं।\n3. धीरे-धीरे पानी डालते हुए चिकना आटा गूंथें। उसे ढककर 15-20 मिनट के लिए आराम दें।\n4. आटे के गोले और मैश किए हुए आलू को बराबर के बॉल में बांटें।\n5. एक आटे का गोला लें, उसे छोटा डिस्क में बेलें और बीच में आलू का गोला रखें।\n6. आटे के किनारों को सील करें और उसे हल्के हाथों से सपाट करें।\n7. आटे के गोले को पराठा में बेलते जाएँ, यदि आवश्यक हो तो आटा छिड़क करें।\n8. मध्यम आंच पर एक तवा गरम करें और उस पर बेला हुआ पराठा रखें।\n9. पराठा को दोनों तरफ से तेल या घी लगाकर सुनहरा और कुरकुरा होने तक पकाएं।\n10. गर्म योगर्ट, अचार या अपनी पसंद की किसी भी चटनी के साथ गर्मा-गरम परोसें।"
            ]
        },
        {
            "id": 6,
            "name": "Dal Makhani",
            "image": "https://www.funfoodfrolic.com/wp-content/uploads/2023/04/Dal-Makhani-Blog.jpg",
            "ingredients": [
                "Whole black lentils (urad dal) [सभी काले दाल (उड़द दाल)]",
                "Red kidney beans (rajma) [राजमा]",
                "Onion [प्याज]",
                "Tomato [टमाटर]",
                "Ginger [अदरक]",
                "Garlic [लहसुन]",
                "Green chili [हरी मिर्च]",
                "Turmeric powder [हल्दी पाउडर]",
                "Red chili powder [लाल मिर्च पाउडर]",
                "Coriander powder [धनिया पाउडर]",
                "Garam masala [गरम मसाला]",
                "Butter [मक्खन]",
                "Cream [मलाई]",
                "Kasuri methi (dried fenugreek leaves) [कसूरी मेथी (सूखी मेथी के पत्ते)]",
                "Oil [तेल]",
                "Salt [नमक]"
            ],
            "English_Instructions": [
                "1. Wash and soak 1 cup of black lentils (urad dal) and 1/4 cup of kidney beans (rajma) overnight.\n2. In a pressure cooker, add the soaked lentils and kidney beans along with 4 cups of water, 1 teaspoon of salt, and 1/2 teaspoon of turmeric powder.\n3. Pressure cook for 6-7 whistles or until the lentils are soft and cooked.\n4. In a separate pan, heat 2 tablespoons of butter or ghee.\n5. Add 1 teaspoon of cumin seeds and let them splutter.\n6. Add 1 tablespoon of ginger-garlic paste and sauté for a minute.\n7. Add 1 cup of finely chopped onions and cook until they turn golden brown.\n8. Add 1 cup of tomato puree and cook until the oil separates.\n9. Add 1 teaspoon of red chili powder, 1 teaspoon of garam masala, and salt to taste.\n10. Mix well and cook for a minute.\n11. Add the cooked lentils and kidney beans to the pan and mix well.\n12. Add 1/2 cup of fresh cream and cook on low heat for 20-25 minutes, stirring occasionally.\n13. Serve hot with naan or rice, garnished with a dollop of butter or cream."
            ],
            "Hindi_Instruction": [
                "1. 1 कप काली मसूर (उड़द दाल) और 1/4 कप राजमा को अच्छी तरह से धोकर रात भर के लिए भिगो दें।\n2. एक प्रेशर कुकर में भिगोई हुई दाल और राजमा को 4 कप पानी, 1 चम्मच नमक और 1/2 चम्मच हल्दी पाउडर के साथ डालें।\n3. 6-7 सीटियों तक प्रेशर कुकर में पकाएं या जब तक दाल मुलायम और पकी हो जाएं।\n4. एक अलग कड़ाही में 2 बड़े चम्मच मक्खन या घी गरम करें।\n5. 1 चम्मच जीरा डालें और उसे फटने दें।\n6. 1 बड़ा चम्मच अदरक-लहसुन की पेस्ट डालें और एक मिनट तक सौटें।\n7. 1 कप बारीकी से कटी हुई प्याज़ डालें और उन्हें सुनहरा होने तक पकाएं।\n8. 1 कप टमाटर प्यूरी डालें और तब तक पकाएं जब तक तेल अलग न हो जाएं।\n9. 1 चम्मच लाल मिर्च पाउडर, 1 चम्मच गरम मसाला और नमक स्वाद के साथ डालें।\n10. अच्छी तरह मिलाएं और एक मिनट तक पकाएं।\n11. पकी हुई दाल और राजमा को कड़ाही में डालें और अच्छी तरह मिलाएं।\n12. 1/2 कप ताजगी क्रीम डालें और हल्की आंच पर 20-25 मिनट पकाएं, बार-बार मिलाते रहें।\n13. नान या चावल के साथ गर्म सर्व करें, ऊपर से मक्खन या क्रीम की एक मोटी थैली से सजाएं।"
            ]
        },
        {
            "id": 7,
            "name": "Baingan Bharta",
            "image": "https://www.indianhealthyrecipes.com/wp-content/uploads/2020/09/baingan-bharta-recipe.jpg",
            "ingredients": [
                "Eggplant (baingan) [बैंगन]",
                "Onion [प्याज]",
                "Tomato [टमाटर]",
                "Green chili [हरी मिर्च]",
                "Ginger [अदरक]",
                "Garlic [लहसुन]",
                "Coriander leaves [धनिया पत्ती]",
                "Cumin seeds [जीरा]",
                "Turmeric powder [हल्दी पाउडर]",
                "Red chili powder [लाल मिर्च पाउडर]",
                "Coriander powder [धनिया पाउडर]",
                "Garam masala [गरम मसाला]",
                "Oil [तेल]",
                "Salt [नमक]"
            ],
            "English_Instructions": [
                "1. Roast 1 large eggplant over an open flame or in a preheated oven until the skin is charred and the flesh becomes soft.\n2. Let the roasted eggplant cool down. Remove the skin and mash the pulp in a bowl.\n3. Heat 2 tablespoons of oil in a pan and add 1 teaspoon of cumin seeds.\n4. Once the seeds start to splutter, add 1 finely chopped onion and sauté until it turns golden brown.\n5. Add 1 tablespoon of ginger-garlic paste and sauté for a minute.\n6. Add 2 finely chopped tomatoes and cook until they become mushy.\n7. Add 1/2 teaspoon of turmeric powder, 1 teaspoon of red chili powder, and salt to taste.\n8. Mix well and cook for a couple of minutes.\n9. Add the mashed eggplant pulp to the pan and mix it with the spices.\n10. Cook for 5-7 minutes, stirring occasionally, until the flavors blend together.\n11. Garnish with freshly chopped coriander leaves and serve hot with roti or rice."
            ],
            "Hindi_Instruction": [
                "1. एक बड़ा बैंगन को खुली आग पर या पहले से गरम किए गए ओवन में भूनें, जब तक छिलका सुनहरा नहीं हो जाता और मांस सॉफ्ट नहीं हो जाता।\n2. भूना हुआ बैंगन को ठंडा होने दें। छिलका हटा दें और बैंगन को एक कटोरी में मैश करें।\n3. एक कड़ाही में 2 बड़े चम्मच तेल गरम करें और 1 चम्मच जीरा डालें।\n4. जब जीरा फटने लगे, तो उसमें 1 बारीकी से कटी हुई प्याज़ डालें और सुनहरा होने तक सौटें।\n5. 1 बड़ा चम्मच अदरक-लहसुन की पेस्ट डालें और एक मिनट तक सौटें।\n6. 2 बारीकी से कटे हुए टमाटर डालें और उन्हें घीलते जाएँ जब तक वे पिस जाएँ।\n7. 1/2 चम्मच हल्दी पाउडर, 1 चम्मच लाल मिर्च पाउडर और नमक स्वाद के अनुसार डालें।\n8. अच्छी तरह मिलाएं और कुछ मिनट के लिए पकाएं।\n9. कड़ाही में मैश किए गए बैंगन को मसालों के साथ मिलाएं।\n10. फ्लेवर्स मिलने तक 5-7 मिनट पकाएं, बार-बार मिलाते रहें।\n11. ताजा काटी हुई धनिया पत्ती से सजाएं और गर्म रोटी या चावल के साथ गर्मा-गरम परोसें।"
            ]
        },
        {
            "id": 8,
            "name": "Palak Paneer",
            "image": "https://images.hindustantimes.com/img/2021/11/26/1600x900/palak_paneer_thumb_1637919968696_1637919979983.jpg",
            "ingredients": [
                "Spinach (palak) [पालक]",
                "Paneer (Indian cottage cheese) [पनीर]",
                "Onion [प्याज]",
                "Tomato [टमाटर]",
                "Green chili [हरी मिर्च]",
                "Ginger [अदरक]",
                "Garlic [लहसुन]",
                "Cumin seeds [जीरा]",
                "Turmeric powder [हल्दी पाउडर]",
                "Red chili powder [लाल मिर्च पाउडर]",
                "Coriander powder [धनिया पाउडर]",
                "Garam masala [गरम मसाला]",
                "Cream [मलाई]",
                "Oil [तेल]",
                "Salt [नमक]"
            ],
            "English_Instructions": [
                "1. Heat 2 tablespoons of oil in a pan and add 1 teaspoon of cumin seeds.\n2. Once the seeds start to splutter, add 1 finely chopped onion and sauté until it turns golden brown.\n3. Add 1 tablespoon of ginger-garlic paste and sauté for a minute.\n4. Add 2 cups of finely chopped spinach (palak) and cook until it wilts down.\n5. Let the mixture cool down and then blend it into a smooth puree.\n6. Heat 1 tablespoon of butter in the same pan and add 1 teaspoon of fenugreek leaves (kasuri methi).\n7. Add the spinach puree to the pan and mix well.\n8. Add 1 teaspoon of turmeric powder, 1 teaspoon of red chili powder, and salt to taste.\n9. Cook for 5 minutes on medium heat.\n10. Add 1 cup of paneer cubes and cook for another 2 minutes.\n11. Stir in 1/4 cup of fresh cream and cook for a minute.\n12. Garnish with a sprinkle of garam masala and serve hot with naan or rice."
            ],
            "Hindi_Instruction": [
                "1. एक कड़ाही में 2 बड़े चम्मच तेल गरम करें और 1 चम्मच जीरा डालें।\n2. जब जीरा फटने लगे, तो उसमें 1 बारीकी से कटी हुई प्याज़ डालें और सुनहरा होने तक सौटें।\n3. 1 बड़ा चम्मच अदरक-लहसुन की पेस्ट डालें और एक मिनट तक सौटें।\n4. 2 कप बारीकी से कटी हुई पालक डालें और जब तक यह कुचल जाएँ तब तक पकाएँ।\n5. मिश्रण को ठंडा होने दें और फिर इसे एक मऊ सत्त्विकता में ब्लेंड करें।\n6. वही कड़ाही में 1 बड़ा चम्मच मक्खन गरम करें और 1 चम्मच कसूरी मेथी डालें।\n7. पालक की प्यूरी को कड़ाही में मिलाएं और अच्छी तरह मिलाएं।\n8. 1 चम्मच हल्दी पाउडर, 1 चम्मच लाल मिर्च पाउडर और नमक स्वाद के अनुसार डालें।\n9. मध्यम आंच पर 5 मिनट पकाएं।\n10. 1 कप पनीर क्यूब्स डालें और और 2 मिनट और पकाएं।\n11. 1/4 कप ताजी क्रीम मिलाएं और एक मिनट तक पकाएं।\n12. गरम मसाले की थोड़ी सी छिड़कावट के साथ सजाएं और नान या चावल के साथ गर्मा-गर्म परोसें।"
            ]
        }
    ],
    "GujaratiFoodAPI": [
        {
            "id": 1,
            "name": "Dhokla",
            "image": "https://www.vegrecipesofindia.com/wp-content/uploads/2021/01/khaman-recipe-2.jpg",
            "ingredients": [
                "Gram flour (besan) [बेसन]",
                "Semolina (sooji/rava) [सूजी/रवा]",
                "Yogurt [दही]",
                "Lemon juice [नींबू का रस]",
                "Ginger paste [अदरक पेस्ट]",
                "Green chili paste [हरी मिर्च पेस्ट]",
                "Turmeric powder [हल्दी पाउडर]",
                "Eno fruit salt [ईनो फ्रूट साल्ट]",
                "Water [पानी]",
                "Salt [नमक]",
                "Sugar [चीनी]",
                "Mustard seeds [सरसों के बीज]",
                "Curry leaves [करी पत्ते]",
                "Fresh coriander leaves [ताजा धनिया पत्ती]"
            ],
            "English_Instructions": [
                "1. In a mixing bowl, add gram flour, semolina, ginger paste, green chili paste, yogurt, lemon juice, turmeric powder, salt, and water. Mix well to form a smooth batter.\n2. Heat water in a steamer or a large pot.\n3. Grease a dhokla plate or a shallow dish with oil.\n4. Add eno fruit salt to the batter and mix gently. The batter will become frothy.\n5. Pour the batter into the greased plate and place it in the steamer.\n6. Steam for 15-20 minutes or until a toothpick inserted in the center comes out clean.\n7. Remove the plate from the steamer and let it cool for a few minutes.\n8. Cut the dhokla into desired shapes, like squares or diamonds.\n9. Heat oil in a pan and add mustard seeds, sesame seeds, curry leaves, and green chilies. Let them crackle.\n10. Pour this tempering over the dhokla pieces.\n11. Garnish with chopped coriander leaves and grated coconut.\n12. Serve dhokla with green chutney or tamarind chutney."
            ],
            "Hindi_Instruction": [
                "1. एक मिश्रण बाउल में बेसन, सूजी, अदरक पेस्ट, हरी मिर्च पेस्ट, दही, नींबू रस, हल्दी पाउडर, नमक और पानी डालें। अच्छी तरह मिलाएं ताकि एक चिकनी बैटर बन जाए।\n2. एक स्टीमर या बड़े बर्तन में पानी गर्म करें।\n3. धोकला प्लेट या एक कम ढीली प्लेट को तेल से चिकना करें।\n4. बैटर में इनो फल्ट सोडा डालें और हल्के हाथों से मिलाएं। बैटर फोमी हो जाएगी।\n5. बैटर को तेल से चिकनी की प्लेट में डालें और इसे स्टीमर में रखें।\n6. 15-20 मिनट तक या जब तक एक टूथपिक को मध्य में डालकर वह साफ बाहर निकल आए, स्टीम करें।\n7. प्लेट को स्टीमर से निकालें और कुछ मिनट के लिए ठंडा होने दें।\n8. धोकला को वर्णनानुसार आकार में काटें, जैसे वर्ग या हीरे।\n9. एक कड़ाही में तेल गर्म करें और राई, तिल, करी पत्ते और हरी मिर्च डालें। उन्हें फुटने दें।\n10. इस तड़के को धोकले के टुकड़ों पर डालें।\n11. कटा हुआ कोरियांदर पत्ती और कसा हुआ नारियल से सजाएँ।\n12. धोकला को हरी चटनी या इमली की चटनी के साथ परोसें।"
            ]
        },
        {
            "id": 2,
            "name": "Khandvi",
            "image": "https://images.aws.nestle.recipes/original/ff75422b53f60e10642b1df6e54f943d_Khandvi_with_sprouts_filling_Plating.jpg",
            "ingredients": [
                "Gram flour (besan) [बेसन]",
                "Sour yogurt [खट्टा दही]",
                "Water [पानी]",
                "Turmeric powder [हल्दी पाउडर]",
                "Ginger paste [अदरक पेस्ट]",
                "Green chili paste [हरी मिर्च पेस्ट]",
                "Salt [नमक]",
                "Oil [तेल]",
                "Mustard seeds [सरसों के बीज]",
                "Sesame [तिल]"
            ],
            "English_Instructions": [
                "1. In a mixing bowl, combine besan (gram flour), yogurt, turmeric powder, ginger paste, green chili paste, salt, and water. Mix well to form a smooth batter.\n2. Heat a non-stick pan on medium heat and pour the batter into it.\n3. Cook the batter while continuously stirring until it thickens and becomes a lump-free mixture.\n4. Immediately pour a ladleful of the batter onto the back of a greased plate or a smooth surface.\n5. Spread the batter thinly using a spatula or the back of a spoon before it cools down and sets.\n6. Let the spread batter cool down for a few minutes.\n7. Cut the spread batter into thin strips using a sharp knife.\n8. Carefully roll each strip tightly and place it on a serving plate.\n9. For tempering, heat oil in a small pan and add mustard seeds, sesame seeds, curry leaves, and green chilies. Let them crackle.\n10. Pour the tempering over the rolled Khandvi.\n11. Garnish with chopped coriander leaves and grated coconut.\n12. Serve Khandvi as a snack or appetizer with green chutney or tamarind chutney."
            ],
            "Hindi_Instruction": [
                "1. एक मिश्रण बाउल में बेसन, दही, हल्दी पाउडर, अदरक पेस्ट, हरी मिर्च पेस्ट, नमक और पानी को मिलाएं। एक चिकनी बैटर बनाने के लिए अच्छी तरह मिलाएं।\n2. मध्यम आंच पर एक नॉन-स्टिक पैन को गर्म करें और उसमें बैटर डालें।\n3. चिकनाई को लगातार हिलाते हुए पकाएं जब तक वह गाढ़ा न हो जाए और एक गुच्छा-मुक्त मिश्रण बन जाए।\n4. तत्काल एक तेल से चिकनी की प्लेट या एक समतल सतह पर बैटर का एक लैडल डालें।\n5. यह बैटर ठंडा होने और सेट होने से पहले एक थिन स्तर बनाएँ एक स्पेचुला या चम्मच की पीठ उपयोग करके।\n6. फैला हुआ बैटर को कुछ मिनट के लिए ठंडा होने दें।\n7. एक तेज़ चाकू का उपयोग करके पतली धारें में फैला हुआ बैटर काटें।\n8. हर धारी को सावधानीपूर्वक रोल करें और उसे एक सर्विंग प्लेट पर रखें।\n9. तड़के के लिए, एक छोटे पैन में तेल गर्म करें और उसमें राई, तिल, करी पत्ते और हरी मिर्च डालें। उन्हें फुटने दें।\n10. तड़के को रोल किए गए खांडवी पर डालें।\n11. कटा हुआ कोरियांदर पत्ती और कसा हुआ नारियल से सजाएँ।\n12. हरी चटनी या इमली की चटनी के साथ खांडवी को एक नाश्ता या अप्पेटाइज़र के रूप में परोसें।"
            ]
        },
        {
            "id": 3,
            "name": "Thepla",
            "image": "https://rakskitchen.net/wp-content/uploads/2009/05/methi-thepla.jpg",
            "ingredients": [
                "Whole wheat flour [गेहूं का आटा]",
                "Gram flour (besan) [बेसन]",
                "Fenugreek leaves (methi) [मेथी पत्ती]",
                "Yogurt [दही]",
                "Ginger paste [अदरक पेस्ट]",
                "Green chili paste [हरी मिर्च पेस्ट]",
                "Turmeric powder [हल्दी पाउडर]",
                "Red chili powder [लाल मिर्च पाउडर]",
                "Coriander powder [धनिया पाउडर]",
                "Cumin powder [जीरा पाउडर]",
                "Oil [तेल]",
                "Salt [नमक]",
                "Water [पानी]"
            ],
            "English_Instructions": [
                "1. In a mixing bowl, combine wheat flour, besan (gram flour), turmeric powder, red chili powder, coriander powder, cumin powder, salt, ginger paste, green chili paste, yogurt, and oil. Mix well.\n2. Gradually add water and knead into a soft dough.\n3. Cover the dough and let it rest for 15-20 minutes.\n4. Divide the dough into small portions and roll each portion into a thin circle.\n5. Heat a tawa or griddle on medium heat and place a rolled thepla on it.\n6. Cook the thepla on both sides, applying oil or ghee, until golden brown spots appear.\n7. Repeat the process for the remaining theplas.\n8. Serve theplas hot with pickle, yogurt, or any side dish of your choice."
            ],
            "Hindi_Instruction": [
                "1. एक मिश्रण बाउल में गेहूं का आटा, बेसन, हल्दी पाउडर, लाल मिर्च पाउडर, धनिया पाउडर, जीरा पाउडर, नमक, अदरक पेस्ट, हरी मिर्च पेस्ट, दही और तेल को मिलाएं। अच्छी तरह मिलाएं।\n2. धीरे-धीरे पानी डालें और मुलायम आटा बनाने के लिए गूंथें।\n3. आटा को ढककर 15-20 मिनट के लिए आराम दें।\n4. आटा को छोटे भागों में बांटें और प्रत्येक भाग को एक पतला गोला बनाएं।\n5. मध्यम आंच पर एक तवा या ग्रिडल को गर्म करें और उस पर एक थिन थेपला रखें।\n6. थेपला को दोनों तरफ से पकाएं, तेल या घी लगाकर, जब तक सुनहरा भूरा दानें न दिखें।\n7. शेष थेपलों के लिए यह प्रक्रिया दोहराएँ।\n8. थेपलों को गर्म परोसें, आचार, दही या अपने पसंदीदा साइड डिश के साथ।"
            ]
        },
        {
            "id": 4,
            "name": "Undhiyu",
            "image": "https://www.secondrecipe.com/wp-content/uploads/2019/03/undhiyu-final.jpg",
            "ingredients": [
                "Purple yam (kand) [जिमीकंद]",
                "Sweet potato [शकरकंद]",
                "Raw banana [कच्चा केला]",
                "Eggplant [बैंगन]",
                "Green beans [हरी फलियाँ]",
                "Carrots [गाजर]",
                "Potatoes [आलू]",
                "Fresh fenugreek leaves (methi) [ताजा मेथी पत्ती]",
                "Fresh coriander leaves [ताजा धनिया पत्ती]",
                "Ginger paste [अदरक पेस्ट]",
                "Garlic paste [लहसुन पेस्ट]",
                "Green chili paste [हरी मिर्च पेस्ट]",
                "Sesame seeds [तिल]",
                "Grated coconut [कसा हुआ नारियल]",
                "Coriander-cumin powder [धनिया-जीरा पाउडर]",
                "Turmeric powder [हल्दी पाउडर]",
                "Red chili powder [लाल मिर्च पाउडर]",
                "Sugar [चीनी]",
                "Tamarind paste [इमली पेस्ट]",
                "Oil [तेल]",
                "Salt [नमक]"
            ],
            "English_Instructions": [
                "1. In a mixing bowl, combine gram flour, semolina, ginger-green chili paste, garlic paste, turmeric powder, red chili powder, coriander-cumin powder, garam masala, sugar, salt, and oil. Mix well to form a dough.\n2. Divide the dough into small portions and shape them into round balls.\n3. Heat oil in a deep pan or kadai and fry the balls until golden brown and crispy. Remove them from oil and keep aside.\n4. In the same pan, add mustard seeds and let them crackle. Then add asafoetida, green chilies, and curry leaves. Sauté for a minute.\n5. Add ginger-garlic paste and sauté until the raw smell disappears.\n6. Add chopped vegetables like surti papdi, brinjal, sweet potato, yam, and potato. Mix well.\n7. Add turmeric powder, red chili powder, coriander-cumin powder, garam masala, sugar, and salt. Mix well to coat the vegetables.\n8. Cover the pan and cook on low heat for 15-20 minutes or until the vegetables are cooked.\n9. Finally, add the fried balls and mix gently.\n10. Garnish with chopped coriander leaves and grated coconut.\n11. Serve hot Undhiyu with puri or roti."
            ],
            "Hindi_Instruction": [
                "1. एक मिश्रण बाउल में बेसन, सूजी, अदरक-हरी मिर्च पेस्ट, लहसुन पेस्ट, हल्दी पाउडर, लाल मिर्च पाउडर, धनिया-जीरा पाउडर, गरम मसाला, चीनी, नमक और तेल को मिलाएं। एक गूंथ कर आटा बनाएं।\n2. आटा को छोटे भागों में बांटें और उन्हें गोल गोल बनाएँ।\n3. एक गहरी पैन या कड़ाही में तेल गरम करें और गोलों को सुनहरा भूरा और कुरकुरा होने तक तलें। उन्हें तेल से निकालें और अलग रखें।\n4. उसी पैन में राई डालें और उन्हें फुटने दें। फिर हींग, हरी मिर्च और करी पत्ते डालें। एक मिनट तक भूनें।\n5. अदरक-लहसुन पेस्ट डालें और जब तक कच्चेपन का गंध नहीं होता है, तब तक भूनें।\n6. सूरती पापड़ी, बैंगन, शकरकंद, जिमिकंद और आलू जैसी कटी हुई सब्जियाँ डालें। अच्छी तरह मिलाएं।\n7. हल्दी पाउडर, लाल मिर्च पाउडर, धनिया-जीरा पाउडर, गरम मसाला, चीनी और नमक डालें। सब्जियों को अच्छी तरह मिलाने के लिए मिलाएं।\n8. पैन को ढककर और हल्की आंच पर 15-20 मिनट तक या जब तक सब्जियाँ पक जाएं तक पकाएं।\n9. अंत में, तले हुए गोलों को मिलाएं और हल्के हाथ से मिक्स करें।\n10. कटे हुए धनिया पत्तियों और कसा हुआ नारियल से सजाएँ।\n11. गर्म उन्धियू को पूरी या रोटी के साथ परोसें।"
            ]
        },
        {
            "id": 5,
            "name": "Gujarati Kadhi",
            "image": "https://ranveerbrar.com/wp-content/uploads/2021/02/Gujarati-Kadhi.png",
            "ingredients": [
                "Yogurt [दही]",
                "Gram flour (besan) [बेसन]",
                "Water [पानी]",
                "Ginger paste [अदरक पेस्ट]",
                "Green chili paste [हरी मिर्च पेस्ट]",
                "Turmeric powder [हल्दी पाउडर]",
                "Curry leaves [करी पत्ते]",
                "Mustard seeds [सरसों के बीज]",
                "Cumin seeds [जीरा]",
                "Asafoetida [हींग]",
                "Oil [तेल]",
                "Salt [नमक]",
                "Sugar [चीनी]"
            ],
            "English_Instructions": [
                "1. In a bowl, whisk together yogurt, gram flour, turmeric powder, ginger-green chili paste, and salt until smooth.\n2. Heat oil in a deep pan or kadai. Add mustard seeds and let them crackle.\n3. Add cumin seeds, fenugreek seeds, asafoetida, curry leaves, and dry red chili. Sauté for a minute.\n4. Pour the yogurt mixture into the pan and mix well.\n5. Add water and whisk again to combine.\n6. Bring the kadhi to a boil on medium heat, stirring continuously.\n7. Reduce the heat to low and simmer the kadhi for 15-20 minutes, stirring occasionally.\n8. In a small pan, heat ghee and add cumin seeds and red chili powder. Fry for a few seconds.\n9. Add this tempering to the kadhi and mix well.\n10. Garnish with chopped coriander leaves.\n11. Serve hot Gujarati Kadhi with steamed rice or khichdi."
            ],
            "Hindi_Instruction": [
                "1. एक कटोरी में दही, बेसन, हल्दी पाउडर, अदरक-हरी मिर्च पेस्ट और नमक को घोलने के लिए मिलाएं, ताकि समग्र हो जाए।\n2. एक गहरी कड़ाही या पैन में तेल गर्म करें। राई डालें और उन्हें फुटने दें।\n3. जीरा, मेथी बीज, हींग, करी पत्ते और सूखी लाल मिर्च डालें। एक मिनट तक भूनें।\n4. कड़ाही में दही का मिश्रण डालें और अच्छी तरह मिलाएं।\n5. पानी डालें और फिर से व्हिस्क करके मिलाएं।\n6. मध्यम आंच पर कड़ाही को उबालने लाएँ, स्वचालित रूप से हलकारे मिलाते रहें।\n7. आंच को कम करें और कड़ाही को 15-20 मिनट तक पकाएँ, आवर्ती रूप से हलकारे मिलाते रहें।\n8. एक छोटे पैन में घी गर्म करें और जीरा और लाल मिर्च पाउडर डालें। कुछ सेकंड के लिए तलें।\n9. यह तड़का कड़ाही में डालें और अच्छी तरह मिलाएं।\n10. कटे हुए धनिया पत्तियों से सजाएँ।\n11. गर्म गुजराती कढ़ी को स्टीम की हुई चावल या खिचड़ी के साथ परोसें।"
            ]
        },
        {
            "id": 6,
            "name": "Fafda",
            "image": "https://images.news18.com/ibnkhabar/uploads/2023/06/fafda-16875144723x2.jpg",
            "ingredients": [
                "Gram flour (besan) [बेसन]",
                "Turmeric powder [हल्दी पाउडर]",
                "Asafoetida [हींग]",
                "Carom seeds (ajwain) [अजवाइन]",
                "Sesame seeds [तिल]",
                "Black pepper [काली मिर्च]",
                "Salt [नमक]",
                "Oil [तेल]"
            ],
            "English_Instructions": [
                "1. In a mixing bowl, combine gram flour, turmeric powder, ajwain, salt, and oil. Mix well.\n2. Gradually add water and knead the mixture into a firm dough.\n3. Divide the dough into small portions and shape them into long strips or oval shapes.\n4. Heat oil in a deep pan or kadai for frying.\n5. Gently slide the shaped fafdas into the hot oil and fry them on medium heat until they turn golden brown and crispy.\n6. Remove the fried fafdas from the oil and place them on absorbent paper to remove excess oil.\n7. Serve hot fafdas with chutney or yogurt."
            ],
            "Hindi_Instruction": [
                "1. एक मिश्रण बाउल में बेसन, हल्दी पाउडर, अजवाइन, नमक और तेल को मिलाएं। अच्छी तरह मिलाएं।\n2. धीरे-धीरे पानी डालें और मिश्रण को कसा हुआ आटा बनाएँ।\n3. आटे को छोटे भागों में बांटें और उन्हें लंबे पट्टे या ओवल आकार में बनाएँ।\n4. तलने के लिए गहरी कड़ाही या पैन में तेल गरम करें।\n5. धीरे-धीरे तैयार किए गए फाफड़ों को गर्म तेल में स्लाइड करें और मध्यम आंच पर सुनहरे भूरे होने तक तलें।\n6. तले हुए फाफड़ों को तेल से निकालें और अधिक तेल निकालने के लिए उन्हें एब्सोर्बेंट पेपर पर रखें।\n7. गर्म फाफड़ों को चटनी या दही के साथ परोसें।"
            ]
        },
        {
            "id": 7,
            "name": "Handvo",
            "image": "https://www.nehascookbook.com/wp-content/uploads/2021/08/Instant-handvo-WS.jpg",
            "ingredients": [
                "Rice flour [चावल का आटा]",
                "Bengal gram flour (besan) [बेसन]",
                "Yogurt [दही]",
                "Bottle gourd (dudhi/lauki) [लौकी]",
                "Carrots [गाजर]",
                "Spinach [पालक]",
                "Ginger paste [अदरक पेस्ट]",
                "Green chili paste [हरी मिर्च पेस्ट]",
                "Turmeric powder [हल्दी पाउडर]",
                "Red chili powder [लाल मिर्च पाउडर]",
                "Sugar [चीनी]",
                "Lemon juice [नींबू का रस]",
                "Eno fruit salt [ईनो फ्रूट साल्ट]",
                "Oil [तेल]",
                "Mustard seeds [सरसों के बीज]",
                "Sesame seeds [तिल]",
                "Curry leaves [करी पत्ते]",
                "Coriander leaves [धनिया पत्ती]",
                "Salt [नमक]"
            ],
            "English_Instructions": [
                "1. In a mixing bowl, combine rice flour, besan (gram flour), grated bottle gourd, yogurt, ginger-garlic paste, green chili paste, turmeric powder, red chili powder, coriander leaves, and salt. Mix well.\n2. Add water as needed to make a thick batter. Mix thoroughly to remove any lumps.\n3. Cover the batter and let it ferment overnight or for 6-8 hours.\n4. After fermentation, add baking soda and lemon juice to the batter. Mix well.\n5. Heat oil in a non-stick pan. Add mustard seeds, cumin seeds, sesame seeds, and curry leaves. Sauté for a minute.\n6. Pour the batter into the pan and spread it evenly. Cover and cook on low heat for 15-20 minutes or until the bottom is golden brown and crispy.\n7. Flip the handvo using a spatula and cook the other side for another 10-15 minutes.\n8. Remove from heat and let it cool slightly before cutting into pieces.\n9. Serve hot handvo with chutney or yogurt."
            ],
            "Hindi_Instruction": [
                "1. एक मिश्रण बाउल में चावल का आटा, बेसन, कद्दूकस की हुई लौकी, दही, अदरक-लहसुन पेस्ट, हरी मिर्च पेस्ट, हल्दी पाउडर, लाल मिर्च पाउडर, धनिया पत्ती और नमक को मिलाएं। अच्छी तरह मिलाएं।\n2. एक गाढ़ा बैटर बनाने के लिए जरूरत के हिसाब से पानी डालें। किसी भी गांठ को हटाने के लिए पूरी तरह मिलाएँ।\n3. बैटर को ढककर रात भर या 6-8 घंटे तक फ़ेर्मेंट करें।\n4. फ़ेर्मेंटेशन के बाद, बैटर में बेकिंग सोडा और नींबू का रस डालें। अच्छी तरह मिलाएँ।\n5. एक नॉन-स्टिक पैन में तेल गर्म करें। राई, जीरा, तिल और कड़ी पत्ते डालें। एक मिनट तक भूनें।\n6. बैटर को पैन में डालें और इसे समान रूप से फैलाएं। ढककर कम आंच पर 15-20 मिनट या जब तक कि नीचली तरफ सुनहरी भूरी न हो जाए।\n7. स्पैचुला का उपयोग करके हण्डवो को पलटें और दूसरी तरफ को और 10-15 मिनट तक पकाएँ।\n8. गर्मी से हटाएं और इसे धीरे-धीरे ठंडा होने दें, फिर टुकड़ों में काटें।\n9. गर्म हण्डवो को चटनी या दही के साथ परोसें।"
            ]
        },
        {
            "id": 8,
            "name": "Methi Muthia",
            "image": "https://www.vegrecipesofindia.com/wp-content/uploads/2012/08/fried-methi-muthia-recipe-1.jpg",
            "ingredients": [
                "Gram flour (besan) [बेसन]",
                "Wheat flour [गेहूं का आटा]",
                "Fenugreek leaves (methi) [मेथी पत्ती]",
                "Semolina (sooji/rava) [सूजी/रवा]",
                "Yogurt [दही]",
                "Ginger paste [अदरक पेस्ट]",
                "Green chili paste [हरी मिर्च पेस्ट]",
                "Turmeric powder [हल्दी पाउडर]",
                "Red chili powder [लाल मिर्च पाउडर]",
                "Coriander powder [धनिया पाउडर]",
                "Cumin powder [जीरा पाउडर]",
                "Sugar [चीनी]",
                "Oil [तेल]",
                "Mustard seeds [सरसों के बीज]",
                "Sesame seeds [तिल]",
                "Asafoetida [हींग]",
                "Curry leaves [करी पत्ते]",
                "Salt [नमक]"
            ],
            "English_Instructions": [
                "1. In a mixing bowl, combine fenugreek leaves, wheat flour, besan (gram flour), turmeric powder, red chili powder, ginger-garlic paste, sesame seeds, yogurt, oil, salt, and sugar. Mix well.\n2. Gradually add water and knead the mixture into a firm dough.\n3. Divide the dough into small portions and shape them into cylindrical or oval-shaped dumplings.\n4. Steam the dumplings in a steamer for about 15-20 minutes or until they are cooked and firm.\n5. Heat oil in a pan for tempering. Add mustard seeds, sesame seeds, curry leaves, and hing (asafoetida). Sauté for a minute.\n6. Add the steamed muthias to the pan and sauté for a few minutes until they turn golden brown and crispy.\n7. Remove from heat and let them cool slightly.\n8. Serve Methi Muthia as a snack or with chutney."
            ],
            "Hindi_Instruction": [
                "1. एक मिश्रण बाउल में मेथी पत्तियां, गेहूं का आटा, बेसन, हल्दी पाउडर, लाल मिर्च पाउडर, अदरक-लहसुन पेस्ट, तिल, दही, तेल, नमक और चीनी को मिलाएं। अच्छी तरह मिलाएं।\n2. धीरे-धीरे पानी डालें और मिश्रण को कसा हुआ आटा बनाएँ।\n3. आटे को छोटे भागों में बांटें और उन्हें लंबी या ओवल आकार में बनाएँ।\n4. मुठिया को भाप में 15-20 मिनट तक या जब तक वे पके हुए और कठोर न हो जाएं, तक भाप करें।\n5. तड़के के लिए पैन में तेल गर्म करें। राई, तिल, कड़ी पत्ते और हींग डालें। एक मिनट तक भूनें।\n6. भाप की हुई मुठियों को पैन में डालें और उन्हें सुनहरे भूरे होने तक और कुछ मिनट तक सौटें।\n7. गर्मी से हटाएं और थोड़ा ठंडा होने दें।\n8. मेथी मुठिया को चटनी के साथ या नाश्ते के रूप में परोसें।"
            ]
        },
        {
            "id": 9,
            "name": "Dal Dhokli",
            "image": "https://www.cookingcarnival.com/wp-content/uploads/2021/07/Dal-Dhokli-7.jpg",
            "ingredients": [
                "Toor dal [तूर दाल]",
                "Wheat flour [गेहूं का आटा]",
                "Gram flour (besan) [बेसन]",
                "Yogurt [दही]",
                "Turmeric powder [हल्दी पाउडर]",
                "Red chili powder [लाल मिर्च पाउडर]",
                "Coriander-cumin powder [धनिया-जीरा पाउडर]",
                "Ginger paste [अदरक पेस्ट]",
                "Green chili paste [हरी मिर्च पेस्ट]",
                "Asafoetida [हींग]",
                "Cumin seeds [जीरा]",
                "Mustard seeds [सरसों के बीज]",
                "Fenugreek seeds (methi) [मेथी बीज]",
                "Curry leaves [करी पत्ते]",
                "Jaggery [गुड़]",
                "Tamarind pulp [इमली का रस]",
                "Oil [तेल]",
                "Salt [नमक]"
            ],
            "English_Instructions": [
                "1. In a mixing bowl, combine whole wheat flour, besan (gram flour), turmeric powder, red chili powder, carom seeds, salt, and oil. Mix well.\n2. Gradually add water and knead the mixture into a firm dough. Let it rest for 10-15 minutes.\n3. Meanwhile, heat oil in a pressure cooker or a deep pan. Add cumin seeds, mustard seeds, asafoetida, curry leaves, and chopped green chilies. Sauté for a minute.\n4. Add chopped onions and sauté until they turn golden brown.\n5. Add ginger-garlic paste and sauté for a minute.\n6. Add tomatoes, turmeric powder, red chili powder, coriander powder, and salt. Cook until the tomatoes are soft and mushy.\n7. Add soaked and boiled pigeon peas (toor dal) along with water. Mix well and pressure cook for 3-4 whistles or cook in a pan until the dal is cooked.\n8. Meanwhile, roll out the dough into a thin sheet and cut it into diamond-shaped pieces (dhokli).\n9. Add the prepared dhokli to the cooked dal and simmer for 10-15 minutes until the dhokli is cooked.\n10. Prepare a tempering by heating ghee in a small pan. Add cumin seeds, mustard seeds, and asafoetida. Pour the tempering over the dal dhokli.\n11. Garnish with freshly chopped coriander leaves and serve hot."
            ],
            "Hindi_Instruction": [
                "1. एक मिश्रण बाउल में गेहूं का आटा, बेसन, हल्दी पाउडर, लाल मिर्च पाउडर, अजवाइन, नमक और तेल को मिलाएं। अच्छी तरह मिलाएं।\n2. धीरे-धीरे पानी डालें और मिश्रण को कसा हुआ आटा बनाएं। इसे 10-15 मिनट के लिए आराम दें।\n3. इसी बीच, एक प्रेशर कुकर या एक गहरे पैन में तेल गर्म करें। जीरा, राई, हींग, कड़ी पत्ते और कटे हुए हरी मिर्च डालें। एक मिनट तक भूनें।\n4. कटे हुए प्याज डालें और उन्हें सुनहरा होने तक भूनें।\n5. अदरक-लहसुन का पेस्ट डालें और एक मिनट तक भूनें।\n6. टमाटर, हल्दी पाउडर, लाल मिर्च पाउडर, धनिया पाउडर और नमक डालें। टमाटर मुलायम और पीसे हुए होने तक पकाएँ।\n7. भिगोई हुई और उबली हुई अरहर की दाल को पानी के साथ मिलाएं। अच्छी तरह मिलाएं और 3-4 सीटियों के लिए प्रेशर कुकर में पकाएँ या एक पैन में पकाएँ जब तक दाल पक जाएँ।\n8. इसी बीच, आटे को एक पतली शीट में बेलें और रोमटेला के आकार में कट लें (ढोकली)।\n9. पकाए गए दाल में तैयार ढोकली डालें और ढोकली पकने तक 10-15 मिनट के लिए धीमी आंच पर पकाएँ।\n10. एक छोटे पैन में घी गर्म करके तड़का तैयार करें। जीरा, राई और हींग डालें। तड़का को दाल ढोकली पर डालें।\n11. ताजा काटी हुई धनिया पत्ती से सजाएं और गर्मा-गर्म ढोकली तत्वों को परोसें।"
            ]
        },
        {
            "id": 10,
            "name": "Shrikhand",
            "image": "https://www.whiskaffair.com/wp-content/uploads/2020/08/Shrikhand-2-3.jpg",
            "ingredients": [
                "Yogurt [दही]",
                "Powdered sugar [चीनी पाउडर]",
                "Cardamom powder [इलायची पाउडर]",
                "Saffron strands [केसर]",
                "Almonds [बादाम]",
                "Pistachios [पिस्ता]"
            ],
            "English_Instructions": [
                "1. Hang the yogurt in a muslin cloth for 4-5 hours to remove excess water.\n2. Transfer the hung yogurt to a mixing bowl and add powdered sugar.\n3. Mix well until the sugar is completely dissolved.\n4. Add saffron strands, cardamom powder, and chopped nuts (almonds, pistachios) to the yogurt mixture.\n5. Mix well to incorporate all the flavors.\n6. Refrigerate the shrikhand for a couple of hours to let the flavors blend.\n7. Serve chilled shrikhand as a dessert or with puri or roti."
            ],
            "Hindi_Instruction": [
                "1. दही को अधिक पानी हटाने के लिए मुस्लिन कपड़े में लपेटकर 4-5 घंटे के लिए हंग करें।\n2. लपेटे हुए दही को एक मिश्रण बाउल में ट्रांसफर करें और पाउडर चीनी डालें।\n3. चीनी पूरी तरह से घुलने तक अच्छी तरह मिलाएं।\n4. दही मिश्रण में केसर के धागे, इलायची पाउडर और कटे हुए द्राक्ष को डालें।\n5. सभी स्वादों को मिलाने के लिए अच्छी तरह मिलाएं।\n6. श्रीखंड को ठंडे में थोड़े घंटे के लिए ठंडा करें ताकि सभी स्वादों का मेल हो सके।\n7. ठंडा श्रीखंड मिठाई के रूप में या पूरी या रोटी के साथ परोसें।"
            ]
        },
        {
            "id": 11,
            "name": "khichdi",
            "image": "https://holycowvegan.net/wp-content/uploads/2014/06/masala-khichdi-featured-image.jpg",
            "ingredients": [
                "Rice [चावल]",
                "Split yellow moong dal [पीली मूंग दाल]",
                "Turmeric powder [हल्दी पाउडर]",
                "Ghee or oil [घी या तेल]",
                "Cumin seeds [जीरा]",
                "Mustard seeds [सरसों के बीज]",
                "Asafoetida [हींग]",
                "Ginger paste [अदरक पेस्ट]",
                "Garlic paste [लहसुन पेस्ट]",
                "Onion [प्याज़]",
                "Tomato [टमाटर]",
                "Red chili powder [लाल मिर्च पाउडर]",
                "Coriander powder [धनिया पाउडर]",
                "Garam masala [गरम मसाला]",
                "Salt [नमक]"
            ],
            "English_Instructions":[
                "1. Wash and soak 1 cup of rice and 1/2 cup of split yellow moong dal for 30 minutes.\n2. In a pressure cooker, add the soaked rice and dal along with 4 cups of water, 1/2 teaspoon of turmeric powder, and salt to taste.\n3. Pressure cook for 4-5 whistles or until the rice and dal are cooked and mushy.\n4. In a pan, heat 2 tablespoons of ghee or oil.\n5. Add 1 teaspoon of cumin seeds and let them splutter.\n6. Add 1/2 teaspoon of mustard seeds and let them crackle.\n7. Add 1/2 teaspoon of asafoetida, 1/2 teaspoon of ginger paste, and 1/2 teaspoon of garlic paste. Sauté for a minute.\n8. Add 1 finely chopped onion and cook until it turns golden brown.\n9. Add 1 finely chopped tomato and cook until it becomes soft and mushy.\n10. Add 1/2 teaspoon of red chili powder, 1/2 teaspoon of coriander powder, and 1/4 teaspoon of garam masala. Mix well.\n11. Pour the cooked rice and dal mixture into the pan and mix everything together.\n12. Adjust the consistency by adding water if needed.\n13. Cook on low heat for 5-10 minutes, stirring occasionally.\n14. Serve hot with yogurt or pickle."
            ],
            "Hindi_Instruction":[
                "1. 1 कप चावल और 1/2 कप पीली मूंग दाल को धोकर 30 मिनट के लिए भिगो दें।\n2. एक प्रेशर कुकर में भिगोए हुए चावल और दाल को 4 कप पानी, 1/2 चम्मच हल्दी पाउडर और स्वाद के लिए नमक के साथ डालें।\n3. 4-5 सीटियों तक प्रेशर कुकर में पकाएँ या जब तक चावल और दाल पक जाएँ और घुल जाएँ।\n4. एक कड़ाही में 2 बड़े चम्मच घी या तेल गरम करें।\n5. 1 चम्मच जीरा डालें और उसे फटने दें।\n6. 1/2 चम्मच सरसों के बीज डालें और उन्हें फटने दें।\n7. 1/2 चम्मच हींग, 1/2 चम्मच अदरक पेस्ट, और 1/2 चम्मच लहसुन पेस्ट डालें। एक मिनट तक सौटें।\n8. 1 बारीकी से कटी हुई प्याज़ डालें और सुनहरा होने तक पकाएं।\n9. 1 बारीकी से कटी हुई टमाटर डालें और नरम और मुलायम होने तक पकाएं।\n10. 1/2 चम्मच लाल मिर्च पाउडर, 1/2 चम्मच धनिया पाउडर, और 1/4 चम्मच गरम मसाला डालें। अच्छी तरह मिलाएं।\n11. पके हुए चावल और दाल का मिश्रण कड़ाही में डालें और सब कुछ मिलाएं।\n12. जरूरत पड़ने पर पानी डालकर संतुलितता समायें।\n13. ढीली आंच पर 5-10 मिनट तक पकाएं, बार-बार मिलाते रहें।\n14. दही या अचार के साथ गर्मा-गर्म सर्व करें।"
            ]
        },
        {
            "id": 12,
            "name": "Dabeli",
            "image": "https://foodiesterminal.com/wp-content/uploads/2018/11/kutchi-dabeli-recipe.jpg",
            "ingredients": [
                "Pav buns [पाव बन्स]",
                "Potatoes [आलू]",
                "Onion [प्याज़]",
                "Peanuts [मूंगफली]",
                "Cashews [काजू]",
                "Tamarind-date chutney [खजूर-इमली की चटनी]",
                "Garlic chutney [लसून की चटनी]",
                "Dabeli masala [दाबेली मसाला]",
                "Jaggery [गुड़]",
                "Butter [मक्खन]",
                "Oil [तेल]",
                "Mustard seeds [सरसों के बीज]",
                "Salt [नमक]",
                "Sev [सेव]",
                "Pomegranate seeds [अनार के बीज]"    
            ],
            "English_Instructions":[
                "1. Heat 2 tablespoons of oil in a pan and add 1/2 teaspoon of mustard seeds.\n2. Once the seeds start to crackle, add 1/4 cup of finely chopped onions and sauté until they turn translucent.\n3. Add 1/4 cup of boiled and mashed potatoes and mix well.\n4. Add 2 tablespoons of dabeli masala, 1 tablespoon of tamarind-date chutney, 1 tablespoon of jaggery, and salt to taste.\n5. Mix everything thoroughly and cook for 2-3 minutes.\n6. Roast 2 tablespoons of peanuts and 2 tablespoons of cashews separately and crush them slightly.\n7. Add the roasted peanuts and cashews to the potato mixture and mix well.\n8. Slit 4 pav buns horizontally, but not all the way through.\n9. Spread some tamarind-date chutney on one side and some garlic chutney on the other side of the pav.\n10. Stuff the pav with the prepared potato mixture.\n11. Heat a griddle and add a little butter or oil.\n12. Toast the stuffed pav on the griddle until they turn crisp and golden brown.\n13. Serve hot with chutneys, sev, and pomegranate seeds as toppings."
            ],
            "Hindi_Instruction":[
                "1. एक कड़ाही में 2 बड़े चम्मच तेल गरम करें और उसमें 1/2 चम्मच सरसों के बीज डालें।\n2. जब बीज फटने लगें, तो उसमें 1/4 कप बारीकी से कटी हुई प्याज़ डालें और सुनहरा होने तक सौटें।\n3. 1/4 कप उबले हुए और मैश किए गए आलू डालें और अच्छी तरह मिलाएं।\n4. उसमें 2 बड़े चम्मच दाबेली मसाला, 1 बड़ा चम्मच खजूर-इमली की चटनी, 1 बड़ा चम्मच गुड़, और स्वाद के अनुसार नमक डालें।\n5. सभी को अच्छी तरह मिलाएं और 2-3 मिनट के लिए पकाएं।\n6. 2 बड़े चम्मच मूंगफली और 2 बड़े चम्मच काजू अलग-अलग तवे पर भूनें और थोड़ा पीस लें।\n7. भूनी हुई मूंगफली और काजू को आलू के मिश्रण में डालें और अच्छी तरह मिलाएं।\n8. 4 पाव बन्स को अंदर से कटें, लेकिन बिलकुल फैलाएं नहीं।\n9. पाव के एक तरफ खजूर-इमली की चटनी और दूसरी तरफ लसून की चटनी लगाएं।\n10. पाव को तैयार किए गए आलू के मिश्रण से भरें।\n11. एक तवे में बटर या तेल डालें और उसमें भरी हुई पाव को सुनहरा और सुक्ष्म भूरे होने तक टोस्ट करें।\n12. चटनियों, सेव, और अनार के बीजों के साथ गर्मा-गर्म सर्व करें।"
            ]
        },
        {
            "id": 12,
            "name": "Bhakri",
            "image": "https://bhukkadrecipes.com/wp-content/uploads/2021/07/DSC_0633-scaled.jpg",
            "ingredients": [
                "Millet flour (bajra atta) [बाजरा आटा]",
                "Salt [नमक]",
                "Water [पानी]",
                "Ghee or oil [घी या तेल]"
            ],
            "English_Instructions": [
                "1. In a mixing bowl, add millet flour and salt. Mix well.\n2. Gradually add water and knead to make a stiff dough.\n3. Cover the dough and let it rest for 15-20 minutes.\n4. Divide the dough into equal-sized balls.\n5. Take a dough ball and roll it into a small circle on a clean surface using a rolling pin.\n6. Heat a tava (griddle) on medium heat.\n7. Place the rolled bhakri on the hot tava.\n8. Cook one side for a minute, then flip it and cook the other side.\n9. Press gently with a spatula to ensure even cooking.\n10. Apply ghee or oil on both sides while cooking to make it crisp.\n11. Serve hot with vegetables, curries, chutney, or yogurt."
            ],
            "Hindi_Instruction": [
                "1. एक मिक्सिंग बाउल में बाजरे का आटा और नमक डालें। अच्छी तरह मिलाएं।\n2. धीरे-धीरे पानी मिलाते हुए एक कठोर आटा बनाएं।\n3. आटे को ढककर 15-20 मिनट के लिए आराम दें।\n4. आटे को बराबर आकार की गोलियों में बांटें।\n5. एक गोली ले और रोलिंग पिन का उपयोग करके एक छोटे से वृत्त को बनाएं।\n6. मध्यम आंच पर एक तवे (ग्रिडल) को गरम करें।\n7. गरम तवे पर बेलने वाली भाकरी रखें।\n8. एक तरफ एक मिनट के लिए पकाएं, फिर उसे उलट दें और दूसरी तरफ पकाएं।\n9. समान रूप से पकाने के लिए एक स्पेचुला से हल्के हाथों से दबाएं।\n10. पकाने के दौरान दोनों तरफ घी या तेल लगाएं ताकि यह कुरकुरा हो जाए।\n11. सब्जियों, करी, चटनी या दही के साथ गरमा-गरम सर्व करें।"
            ]
        }
    ],
    "Dessert": [
        {
            "id": 1,
            "name": "Gulab Jamun",
            "image": "https://www.spiceupthecurry.com/wp-content/uploads/2020/08/gulab-jamun-recipe-2-500x500.jpg",
            "ingredients": [
                "Milk powder [दूध का पाउडर]",
                "All-purpose flour (maida) [मैदा]",
                "Baking powder [बेकिंग पाउडर]",
                "Ghee [घी]",
                "Milk [दूध]",
                "Sugar [चीनी]",
                "Water [पानी]",
                "Cardamom powder [इलायची पाउडर]",
                "Saffron strands [केसर]",
                "Rose water [गुलाब जल]"
            ],
            "English_Instructions": [
                "1. In a mixing bowl, combine milk powder, all-purpose flour, baking powder, and ghee. Mix well.\n2. Gradually add milk and knead the mixture into a soft dough. Cover and let it rest for 10-15 minutes.\n3. Meanwhile, prepare the sugar syrup. In a pan, combine sugar, water, cardamom powder, saffron strands, and rose water. Mix well and bring it to a boil. Simmer for 5-6 minutes until the syrup is slightly sticky.\n4. Divide the dough into small portions and shape them into smooth balls.\n5. Heat oil in a pan for deep frying. Gently slide the balls into the hot oil and fry them on medium heat until they turn golden brown.\n6. Remove the fried gulab jamuns from the oil and place them on absorbent paper to remove excess oil.\n7. Add the fried gulab jamuns to the sugar syrup and let them soak for 2-3 hours.\n8. Serve hot gulab jamuns with sugar syrup."
            ],
            "Hindi_Instruction": [
                "1. एक मिश्रण बाउल में दूध का पाउडर, मैदा, बेकिंग पाउडर और घी को मिलाएं। अच्छी तरह मिलाएं।\n2. धीरे-धीरे दूध डालें और मिश्रण को एक नरम आटा बनाएं। ढककर इसे 10-15 मिनट के लिए आराम दें।\n3. इसी बीच, चीनी का रस तैयार करें। एक पैन में चीनी, पानी, इलायची पाउडर, केसर धागे और गुलाब जल को मिलाएं। अच्छी तरह मिलाएं और इसे उबाल आने तक पकाएं। थोड़ी देर तक धीमी आंच पर पकाएं जब तक कि चाशनी थोड़ी चिपचिपी न हो जाए।\n4. आटे को छोटे भागों में बांटें और उन्हें गोल गोल बनाएं।\n5. तलने के लिए तेल गरम करें। ध धीरे-धीरे तैयार किए गए गुलाब जामुन को गर्म तेल में स्लाइड करें और मध्यम आंच पर सुनहरे भूरे होने तक तलें।\n6. तले हुए गुलाब जामुन को तेल से निकालें और अधिक तेल निकालने के लिए उन्हें एब्सोर्बेंट पेपर पर रखें।\n7. तले हुए गुलाब जामुन को चाशनी में डालें और उन्हें 2-3 घंटे के लिए भिगोने दें।\n8. गर्म गुलाब जामुन को चाशनी के साथ परोसें।"
            ]
        },
        {
            "id": 2,
            "name": "Rasgulla",
            "image": "https://static.toiimg.com/thumb/52743612.cms?width=1200&height=900",
            "ingredients": [
                "Milk [दूध]",
                "Lemon juice [नींबू का रस]",
                "Sugar [चीनी]",
                "Water [पानी]",
                "Cardamom powder [इलायची पाउडर]",
                "Rose water [गुलाब जल]"
            ],
            "English_Instructions": [
                "1. In a large pot, boil 1 liter of milk. Once it comes to a boil, reduce the heat to low.\n2. Add 1 tablespoon of lemon juice or vinegar to the milk, stirring gently. The milk will curdle and separate into cheese solids (paneer) and whey.\n3. Strain the curdled milk through a muslin cloth or cheesecloth. Rinse it under cold water to remove the lemony taste.\n4. Squeeze out excess water from the paneer and hang it for 1 hour to remove any remaining whey.\n5. After an hour, knead the paneer on a clean surface until it becomes smooth and soft.\n6. Divide the paneer into small equal-sized balls and roll them between your palms to make smooth, crack-free balls.\n7. In a large pot, combine 2 cups of sugar and 4 cups of water. Bring it to a boil, stirring until the sugar dissolves.\n8. Gently drop the paneer balls into the boiling sugar syrup. Cover the pot and cook on medium heat for about 15 minutes.\n9. Remove the pot from heat and let the rasgullas cool down in the syrup.\n10. Serve the Rasgullas chilled, garnished with saffron strands and pistachio slivers, if desired."
            ],
            "Hindi_Instruction": [
                "1. एक बड़े पतीले में 1 लीटर दूध उबालें। जब यह उबलने लगे, आंच कम करें।\n2. दूध में 1 बड़ा चम्मच नींबू रस या सिरका डालें और हल्की-फुल्की मिलाते रहें। दूध खड़ा हो जाएगा और पनीर और वे का पानी अलग हो जाएगा।\n3. खड़े हुए दूध को मलमिन पट्टी या चीज़क्लॉथ से छानें। नींबू का स्वाद हटाने के लिए इसे ठंडे पानी में धो लें।\n4. पनीर से अतिरिक्त पानी निचोड़ें और बचा हुआ वे हटाने के लिए इसे 1 घंटे तक लटका दें।\n5. एक घंटे के बाद, साफ सतह पर पनीर को मुलायम और नरम बनाने के लिए मालिश करें।\n6. पनीर को छोटे बराबर गोलों में बांटें और उन्हें अपनी हथेलियों के बीच गोल गोले बनाएँ।\n7. एक बड़े पतीले में 2 कप चीनी और 4 कप पानी मिलाएँ। चीनी घुलने तक पकाएँ, मिलाते रहें।\n8. आंच में नरम पनीर के गोले हल्की-फुल्की गुलाबी चाशनी में डालें। पतीला ढककर मध्यम आंच पर लगभग 15 मिनट तक पकाएँ।\n9. पतीला आंच से हटाएं और गुलाब जामुन को शीर में ठंडा होने दें।\n10. चाहें तो ठंडा गुलाब जामुन पर सफ़ेद केसर धागे और पिस्ता की पत्तियों से सजाएं और परोसें।"
            ]
        },
        {
            "id": 3,
            "name": "Jalebi",
            "image": "https://images.indianexpress.com/2020/04/jalebis-759.jpg?w=389",
            "ingredients": [
                "All-purpose flour (maida) [मैदा]",
                "Cornflour [कॉर्नफ्लार]",
                "Baking soda [बेकिंग सोडा]",
                "Saffron strands [केसर]",
                "Milk [दूध]",
                "Oil or ghee [तेल या घी]",
                "Sugar [चीनी]",
                "Water [पानी]",
                "Pistachios [पिस्ता]",
                "Almonds [बादाम]"
            ],
            "English_Instructions": [
                "1. In a large bowl, combine 1 cup of all-purpose flour, 1 tablespoon of cornflour, and a pinch of baking soda.\n2. Gradually add water and mix to form a smooth batter. Let it rest for 15-20 minutes.\n3. In a separate bowl, dissolve 1/4 teaspoon of saffron strands in 2 tablespoons of warm milk.\n4. Heat oil or ghee in a wide, shallow pan for deep frying.\n5. Fill a piping bag with the batter and snip off a small hole at the end.\n6. Pipe the batter in a spiral shape into the hot oil, starting from the center and moving outwards.\n7. Fry the jalebis on medium heat until they turn golden brown and crispy.\n8. Remove the fried jalebis and drain excess oil.\n9. Dip the jalebis into the warm sugar syrup for a few seconds, then remove and place them on a serving plate.\n10. Garnish with chopped pistachios or slivered almonds, if desired.\n11. Serve the Jalebis warm or at room temperature, and enjoy!"
            ],
            "Hindi_Instruction": [
                "1. एक बड़े प्याले में 1 कप मैदा, 1 बड़ा चम्मच कॉर्नफ्लार, और एक चुटकी बेकिंग सोडा को मिलाएं।\n2. धीरे-धीरे पानी मिलाते रहें और एक मुलायम बैटर बनाने के लिए मिलाएं। इसे 15-20 मिनट के लिए ढक दें।\n3. एक अलग बाउल में 1/4 चम्मच केसर के धागे को 2 बड़े चम्मच गर्म दूध में घुलाएं।\n4. तलने के लिए एक चौड़ा, छोटा कड़ाही में तेल या घी गर्म करें।\n5. एक पाइपिंग बैग में बैटर भरें और एक छोटा होल छीड़ें।\n6. तेल में पाइपिंग बैग से बैटर को घूंघराली आकृति में पाइप करें, केंद्र से शुरू करके बाहर ले जाएं।\n7. धीमी आंच पर जलेबी को सुनहरा और कुरकुरा होने तक तलें।\n8. तले हुए जलेबी को निकालें और अतिरिक्त तेल को छानें।\n9. गर्म चीनी के रस में जलेबी को कुछ सेकंड के लिए डिप करें, फिर निकालें और सर्व करने की प्लेट पर रखें।\n10. इच्छानुसार, कटे हुएपिस्ता या बादाम से सजाएं।\n11. जलेबी को गर्म या कमरे के तापमान पर परोसें और मज़े करें!"
            ]
        },
        {
            "id": 4,
            "name": "Kheer",
            "image": "https://www.cookwithkushi.com/wp-content/uploads/2019/10/best_rice_kheer_recipe_doodh_pak.jpg",
            "ingredients": [
                "Basmati rice [बासमती चावल]",
                "Milk [दूध]",
                "Sugar [चीनी]",
                "Cardamom powder [इलायची पाउडर]",
                "Saffron strands [केसर]",
                "Almonds [बादाम]",
                "Cashews [काजू]",
                "Pistachios [पिस्ता]",
                "Raisins [किशमिश]"
            ],
            "English_Instructions": [
                "1. Rinse 1/4 cup of basmati rice under running water until the water runs clear. Drain and set aside.\n2. In a large saucepan, bring 4 cups of milk to a boil over medium heat.\n3. Add the rinsed rice to the boiling milk and stir well. Simmer on low heat for about 20 minutes or until the rice is fully cooked and the kheer thickens.\n4. Add 1/2 cup of sugar and stir until dissolved. You can adjust the amount of sugar according to your taste.\n5. Add 1/4 teaspoon of cardamom powder and a pinch of saffron strands for flavor. Stir well.\n6. Add a handful of chopped nuts (such as almonds, cashews, and pistachios) and raisins. Stir and simmer for another 5 minutes.\n7. Remove the kheer from heat and let it cool for a while.\n8. You can serve the kheer warm or chilled, garnished with more chopped nuts and a sprinkle of saffron strands."
            ],
            "Hindi_Instruction": [
                "1. 1/4 कप बासमती चावल को दौड़ते पानी में धोकर साफ़ करें। पानी की साफ़ी के बाद चावल को छान लें और अलग रखें।\n2. एक बड़े पैन में मध्यम आंच पर 4 कप दूध उबालें।\n3. उबलते हुए दूध में धोए हुए चावल डालें और अच्छी तरह से मिलाएं। हल्की आंच पर लगभग 20 मिनट तक धीमी आंच पर पकाएं, जब तक चावल पूरी तरह से पक जाएं और खीर गाढ़ी न हो जाए।\n4. 1/2 कप चीनी डालें और तब तक मिलाएं जब तक यह घुल नहीं जाती है। आप अपने स्वाद के अनुसार चीनी की मात्रा को समायोजित कर सकते हैं।\n5. स्वाद के लिए 1/4 चम्मच इलायची पाउडर और एक चुटकी केसर के धागे डालें। अच्छी तरह से मिलाएं।\n6. कुछ कटे हुए द्राक्ष (जैसे की बादाम, काजू और पिस्ता) और किशमिश डालें। मिलाएं और और 5 मिनट तक पकाएं।\n7. खीर को आंच से हटाएं और इसे थोड़ा ठंडा होने दें।\n8. आप खीर को गर्म या ठंडा परोस सकते हैं, उसे और कटे हुए द्राक्ष और थोड़ा सा केसर सजाएं।"
            ]
        },
        {
            "id": 5,
            "name": "Barfi",
            "image": "https://i.ndtvimg.com/i/2017-08/kaju-barfi_650x400_71501923806.jpg",
            "ingredients": [
                "Milk powder [दूध का पाउडर]",
                "Condensed milk [कंडेंस्ड मिल्क]",
                "Ghee [घी]",
                "Cardamom powder [इलायची पाउडर]",
                "Saffron strands [केसर]",
                "Almonds [बादाम]",
                "Pistachios [पिस्ता]"
            ],
            "English_Instructions": [
                "1. In a heavy-bottomed pan, heat 2 tablespoons of ghee (clarified butter) over low heat.\n2. Add 2 cups of milk powder and 1 cup of condensed milk to the pan. Mix well.\n3. Cook the mixture on low heat, stirring continuously to avoid burning, until it thickens and starts to leave the sides of the pan.\n4. Add 1/2 teaspoon of cardamom powder and a pinch of saffron strands for flavor. Mix well.\n5. Grease a plate or a tray with ghee and set it aside.\n6. Pour the thickened mixture onto the greased plate and spread it evenly using a spatula.\n7. Garnish with chopped nuts (such as almonds or pistachios) on top and press them gently into the mixture.\n8. Let it cool for a while, then refrigerate for a few hours to set.\n9. Once it has set, cut the barfi into desired shapes and serve."
            ],
            "Hindi_Instruction": [
                "1. एक भारी तली वाले पैन में 2 बड़े चम्मच घी को हल्की आंच पर गरम करें।\n2. पैन में 2 कप मिल्क पाउडर और 1 कप कंडेंस्ड मिल्क डालें। अच्छी तरह से मिलाएं।\n3. मिश्रण को हल्की आंच पर पकाएं, जलने से बचने के लिए लगातार मिलाते रहें, जब तक यह गाढ़ा हो जाएँ और पैन के किनारों से छूटने लगे।\n4. स्वाद के लिए 1/2 चम्मच इलायची पाउडर और एक चुटकी केसर के धागे डालें। अच्छी तरह से मिलाएं।\n5. एक प्लेट या ट्रे को घी से चिकना करें और इसे अलग रखें।\n6. घी से चिकना किया हुआ मिश्रण को प्लेट पर ढलाएं और एक स्पैचुला का उपयोग करके इसे बराबर रूप में फैलाएं।\n7. ऊपर छोटे टुकड़े कटे हुए द्राक्ष (जैसे की बादाम या पिस्ता) से सजाएं और उन्हें ढलाएं।\n8. इसे ठंडा होने दें, फिर कुछ घंटे तक ठंडे में रखें ताकि यह जम जाए।\n9. जब यह जम जाए, तो बर्फी को चाहे ताकत के आकार में काटें और परोसें।"
            ]
        },
        {
            "id": 6,
            "name": "Falooda",
            "image": "https://shwetainthekitchen.com/wp-content/uploads/2020/06/IMG_0058-scaled.jpg",
            "ingredients": [
                "Falooda sev [फालूदा सेव]",
                "Milk [दूध]",
                "Rose syrup [गुलाब शरबत]",
                "Vanilla ice cream [वेनिला आइसक्रीम]",
                "Sugar [चीनी]",
                "Sabja seeds [सब्जा बीज]",
                "Pistachios [पिस्ता]",
                "Almonds [बादाम]"
            ],
            "English_Instructions": [
                "1. Soak 2 tablespoons of falooda seeds (basil seeds) in 1/2 cup of water for about 20 minutes.\n2. Cook 1/4 cup of falooda sev (vermicelli) in boiling water until soft. Drain and set aside.\n3. In a glass, add a layer of soaked falooda seeds at the bottom.\n4. Pour 2 tablespoons of rose syrup over the seeds, followed by a scoop of vanilla ice cream.\n5. Add a layer of cooked falooda sev over the ice cream.\n6. Pour chilled milk over the sev, leaving some space at the top.\n7. Top it off with a scoop of mango or strawberry ice cream.\n8. Garnish with chopped nuts (such as almonds or pistachios) and a cherry on top.\n9. Insert a straw and serve the Falooda chilled."
            ],
            "Hindi_Instruction": [
                "1. 2 बड़े चम्मच फ़लूदा बीज (बाज़िल बीज) को 1/2 कप पानी में लगभग 20 मिनट के लिए भिगो दें।\n2. उबलते पानी में 1/4 कप फ़लूदा सेव (वर्मिसेली) को तकरीबन नरम होने तक पकाएं। छानें और अलग रखें।\n3. एक गिलास में भिगोए हुए फ़लूदा बीज की एक परत बनाएँ।\n4. ऊपर से 2 बड़े चम्मच गुलाबी रोज़ रस डालें, इसके बाद एक स्कूप वैनिला आइसक्रीम डालें।\n5. आइसक्रीम के ऊपर फ़लूदा सेव की एक परत बनाएँ।\n6. सेव पर ठंडा दूध डालें, ऊपर कुछ जगह छोड़ें।\n7. ऊपर से एक स्कूप आम या स्ट्रॉबेरी आइसक्रीम डालें।\n8. कटे हुए द्राक्ष (जैसे की बादाम या पिस्ता) और ऊपर एक चेरी से सजाएं।\n9. एक स्ट्रॉ डालें और ठंडे फ़लूदा को परोसें।"
            ]
        }
    ]
}
